MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
/**************************************************************************//**
 * @file     M0519.h
 * @version  V3.0
 * $Revision: 105 $
 * $Date: 15/07/07 5:00p $
 * @brief    M0519 Series Peripheral Access Layer Header File
 *
 * @note
 * @copyright SPDX-License-Identifier: Apache-2.0
 * @copyright Copyright (C) 2014 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/



/**
  \mainpage Introduction
  *
  *
  * This user manual describes the usage of M0519 Series MCU device driver
  *
  * <b>Disclaimer</b>
  *
  * The Software is furnished "AS IS", without warranty as to performance or results, and
  * the entire risk as to performance or results is assumed by YOU. Nuvoton disclaims all
  * warranties, express, implied or otherwise, with regard to the Software, its use, or
  * operation, including without limitation any and all warranties of merchantability, fitness
  * for a particular purpose, and non-infringement of intellectual property rights.
  *
  * <b>Copyright Notice</b>
  *
  * Copyright (C) 2015~2024 Nuvoton Technology Corp. All rights reserved.
  */

#ifndef __M0519_H__
#define __M0519_H__

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
*/

/** @addtogroup CMSIS Device Definitions for CMSIS
  Interrupt Number Definition and Configurations for CMSIS
  @{
*/

/**
 * @details  Interrupt Number Definition. The maximum of 32 Specific Interrupts are possible.
 */

typedef enum IRQn
{
    /******  Cortex-M0 Processor Exceptions Numbers ***************************************************/
    NonMaskableInt_IRQn         = -14,    /*!< Non Maskable Interrupt                                 */
    HardFault_IRQn              = -13,    /*!< Cortex-M0 Hard Fault Interrupt                         */
    SVCall_IRQn                 = -5,     /*!< Cortex-M0 SV Call Interrupt                            */
    PendSV_IRQn                 = -2,     /*!< Cortex-M0 Pend SV Interrupt                            */
    SysTick_IRQn                = -1,     /*!< Cortex-M0 System Tick Interrupt                        */

    /******  ARMIKMCU Swift specific Interrupt Numbers ************************************************/
    BOD_IRQn                  = 0,        /*!< Brown-Out Low Voltage Detected Interrupt               */
    WDT_IRQn                  = 1,        /*!< Watch Dog Timer Interrupt                              */
    EINT0_IRQn                = 2,        /*!< EINT0 Interrupt                                        */
    EINT1_IRQn                = 3,        /*!< EINT1 Interrupt                                        */
    GPG0_IRQn                 = 4,        /*!< GPIO_P0P1P2P3P4 Interrupt                              */
    GPG1_IRQn                 = 5,        /*!< GPIO_P5P6P7P8P9PA Interrupt                            */
    BPWM0_IRQn                 = 6,       /*!< BPWM0 Interrupt                                        */
    EADC0_IRQn                = 7,        /*!< EADC0 Interrupt                                        */
    TMR0_IRQn                 = 8,        /*!< TIMER0 Interrupt                                       */
    TMR1_IRQn                 = 9,        /*!< TIMER1 Interrupt                                       */
    TMR2_IRQn                 = 10,       /*!< TIMER2 Interrupt                                       */
    TMR3_IRQn                 = 11,       /*!< TIMER3 Interrupt                                       */
    UART0_IRQn                = 12,       /*!< UART0 Interrupt                                        */
    UART1_IRQn                = 13,       /*!< UART1 Interrupt                                        */
    SPI0_IRQn                 = 14,       /*!< SPI0 Interrupt                                         */
    SPI1_IRQn                 = 15,       /*!< SPI1 Interrupt                                         */
    SPI2_IRQn                 = 16,       /*!< SPI2 Interrupt                                         */
    REV_IRQn                  = 17,
    I2C0_IRQn                 = 18,       /*!< I2C0 Interrupt                                         */
    CKD_IRQn                  = 19,       /*!< CKD Interrupt                                          */
    EPWM0_IRQn                = 21,       /*!< Enhanced PWM0 Interrupt                                */
    EPWM1_IRQn                = 22,       /*!< Enhanced PWM1 Interrupt                                */
    ECAP0_IRQn                = 23,       /*!< Enhanced Input Capture 0 Interrupt                     */
    ECAP1_IRQn                = 24,       /*!< Enhanced Input Capture 1 Interrupt                     */
    ACMP_IRQn                 = 25,       /*!< ACMP  Interrupt                                        */
    REV0_IRQn                 = 26,
    REV1_IRQn                 = 27,
    PWRWU_IRQn                = 28,       /*!< Power Down Wake Up Interrupt                           */
    EADC1_IRQn                = 29,       /*!< EADC1 Interrupt                                        */
    EADC2_IRQn                = 30,       /*!< EADC2 Interrupt                                        */
    EADC3_IRQn                = 31,       /*!< EADC3 Interrupt                                        */
} IRQn_Type;


/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M0 Processor and Core Peripherals */
#define __MPU_PRESENT           0       /*!< armikcmu does not provide a MPU present or not       */
#define __NVIC_PRIO_BITS        2       /*!< armikcmu Supports 2 Bits for the Priority Levels     */
#define __Vendor_SysTickConfig  0       /*!< Set to 1 if different SysTick Config is used         */
#define __FPU_PRESENT           0
#ifndef __SOFTFP__
    #define __SOFTFP__             1
#endif

/*@}*/ /* end of group CMSIS */


