MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
// Note: Changed for MikroE implementation.
// #include "core_cm0.h"                   /* Cortex-M0 processor and core peripherals               */
// Note: Changed for MikroE implementation.
// #include "system_M0519.h"        /* M0519 System                                          */
#include <stdint.h>

#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.

#if defined ( __CC_ARM   )
    #pragma anon_unions
#endif


/*-------------------------------- Device Specific Peripheral registers structures ---------------------*/
/** @addtogroup REGISTER Control Register
  Peripheral Control Registers
  @{
 */

/*---------------------- Analog Comparator Controller -------------------------*/
/**
    @addtogroup ACMP Analog Comparator Controller (ACMP)
    Memory Mapped Structure for ACMP Controller
@{ */


typedef struct
{


    /**
     * @var ACMP_T::CR
     * Offset: 0x00 ~ 0x08 Analog Comparator 0 ~ 2 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ACMP_EN   |Comparator Enable
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |[1]     |ACMPIE    |Comparator Interrupt Enable
     * |        |          |0 = Interrupt function Disabled.
     * |        |          |1 = Interrupt function Enabled.
     * |[2]     |ACMP_HYS_EN |Comparator Hysteresis Enable
     * |        |          |0 = Hysteresis function Disabled (Default).
     * |        |          |1 = Hysteresis function Enabled.
     * |[3]     |CP        |Comparator Positive Input Selection
     * |        |          |0 = The comparator reference pin ACMPx_P (x=0,1) is selected as the positive comparator input.
     * |        |          |1 = The internal OP amplifier output is selected as the positive comparator input.
     * |        |          |Note: This bit field is reserved in ACMP2CR register.
     * |[4]     |CN        |Comparator Negative Input Selection
     * |        |          |0 = The comparator reference pin ACMPx_N (x=0,1,2) is selected as the negative comparator input.
     * |        |          |1 = Internal band-gap reference voltage is selected as the source of negative
     * |        |          |    comparator input.
     * |[6]     |ACMPINV  |Comparator Output Inverse Enable
     * |        |          |0 = Comparator analog output inverse function is Disabled.
     * |        |          |1 = Comparator analog output inverse function is Enabled.
     * @var ACMP_T::SR
     * Offset: 0x0C  Analog Comparator Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ACMPF0    |Comparator 0 Interrupt Flag
     * |        |          |This bit is set by hardware whenever the comparator 0 output changes state.
     * |        |          |This will cause an interrupt if ACMPIE (ACMP0CR[1]) is set to 1.
     * |        |          |Write 1 to clear this bit to 0.
     * |[1]     |ACMPF1    |Comparator 1 Interrupt Flag
     * |        |          |This bit is set by hardware whenever the comparator 1 output changes state.
     * |        |          |This will cause an interrupt if ACMPIE (ACMP1CR[1]) is set to 1.
     * |        |          |Write 1 to clear this bit to 0.
     * |[2]     |ACMPF2    |Comparator 2 Interrupt Flag
     * |        |          |This bit is set by hardware whenever the comparator 2 output changes state.
     * |        |          |This will cause an interrupt if ACMPIE (ACMP2CR[1]) is set to 1.
     * |        |          |Write 1 to clear this bit to 0.
     * |[4]     |OPDF0     |OP Amplifier 0 Schmitt Trigger Digital Output Interrupt Flag
     * |        |          |OPDF0 interrupt flag is set by hardware whenever the OP amplifier 0 Schmitt
     * |        |          |trigger non-inverting buffer digital output changes state.
     * |        |          |Note: This bit is remapping from OPASR[4] and writing 1 to ACMPSR[4] or OPASR[4] can clear this bit.
     * |[5]     |OPDF1     |OP Amplifier 1 Schmitt Trigger Digital Output Interrupt Flag
     * |        |          |OPDF1 interrupt flag is set by hardware whenever the OP amplifier 1 Schmitt
     * |        |          |trigger non-inverting buffer digital output changes state.
     * |        |          |Note: This bit is remapping from OPASR[5] and writing 1 to ACMPSR[5] or OPASR[5] can clear this bit.
     * |[8]     |CO0       |Comparator 0 Output
     * |        |          |Synchronized to the APB clock to allow reading by software.
     * |        |          |Cleared when the comparator 0 is disabled (ACMP0_EN = 0).
     * |[9]     |CO1       |Comparator 1 Output
     * |        |          |Synchronized to the APB clock to allow reading by software.
     * |        |          |Cleared when the comparator 1 is disabled (ACMP1_EN = 0).
     * |[10]    |CO2       |Comparator 2 Output
     * |        |          |Synchronized to the APB clock to allow reading by software.
     * |        |          |Cleared when the comparator 2 is disabled (ACMP2_EN = 0).
     */

    __IO uint32_t CR[3];         /* Offset: 0x00 ~ 0x08 Analog Comparator 0 ~ 2 Control Register                     */
    __IO uint32_t SR;            /* Offset: 0x0C  Analog Comparator Status Register                                  */

} ACMP_T;



/**
    @addtogroup ACMP_CONST ACMP Bit Field Definition
    Constant Definitions for ACMP Controller
@{ */


/* CR Bit Field Definitions */
#define ACMP_CR_ACMPINV_Pos       6                                   /*!< ACMP_T::CR: ACMPINV Position */
#define ACMP_CR_ACMPINV_Msk       (1ul << ACMP_CR_ACMPINV_Pos)        /*!< ACMP_T::CR: ACMPINV Mask */

#define ACMP_CR_CN_Pos            4                                   /*!< ACMP_T::CR: CN Position */
#define ACMP_CR_CN_Msk            (1ul << ACMP_CR_CN_Pos)             /*!< ACMP_T::CR: CN Mask */

