MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
    __IO uint32_t PWRCON;        /* Offset: 0x00  System Power-down Control Register                                 */
    __IO uint32_t AHBCLK;        /* Offset: 0x04  AHB Devices Clock Enable Control Register                          */
    __IO uint32_t APBCLK;        /* Offset: 0x08  APB Devices Clock Enable Control Register                          */
    __IO uint32_t CLKSTATUS;     /* Offset: 0x0C  Clock Status Monitor Register                                      */
    __IO uint32_t CLKSEL0;       /* Offset: 0x10  Clock Source Select Control Register 0                             */
    __IO uint32_t CLKSEL1;       /* Offset: 0x14  Clock Source Select Control Register 1                             */
    __IO uint32_t CLKDIV;        /* Offset: 0x18  Clock Divider Number Register                                      */
    __IO uint32_t CLKSEL2;       /* Offset: 0x1C  Clock Source Select Control Register 2                             */
    __IO uint32_t PLLCON;        /* Offset: 0x20  PLL Control Register                                               */
    __IO uint32_t FRQDIV;        /* Offset: 0x24  Frequency Divider Control Register                                 */
    __IO uint32_t CLKDCR;        /* Offset: 0x28  Clock Detect Control Register                                      */
    __IO uint32_t CLKDSR;        /* Offset: 0x2C  Clock Detect Status Register                                       */

} CLK_T;



/**
    @addtogroup CLK_CONST CLK Bit Field Definition
    Constant Definitions for CLK Controller
@{ */

/* CLK PWRCON Bit Field Definitions */
#define CLK_PWRCON_PD_WU_STS_Pos             6                                    /*!< CLK_T::PWRCON: PD_WU_STS Position */
#define CLK_PWRCON_PD_WU_STS_Msk             (1ul << CLK_PWRCON_PD_WU_STS_Pos)    /*!< CLK_T::PWRCON: PD_WU_STS Mask */

#define CLK_PWRCON_PD_WU_INT_EN_Pos          5                                    /*!< CLK_T::PWRCON: PD_WU_INT_EN Position */
#define CLK_PWRCON_PD_WU_INT_EN_Msk          (1ul << CLK_PWRCON_PD_WU_INT_EN_Pos) /*!< CLK_T::PWRCON: PD_WU_INT_EN Mask */

#define CLK_PWRCON_OSC10K_EN_Pos             3                                    /*!< CLK_T::PWRCON: OSC10K_EN Position */
#define CLK_PWRCON_OSC10K_EN_Msk             (1ul << CLK_PWRCON_OSC10K_EN_Pos)    /*!< CLK_T::PWRCON: OSC10K_EN Mask */
#define CLK_PWRCON_IRC10K_EN_Pos             3                                    /*!< CLK_T::PWRCON: IRC10K_EN Position */
#define CLK_PWRCON_IRC10K_EN_Msk             (1ul << CLK_PWRCON_IRC10K_EN_Pos)    /*!< CLK_T::PWRCON: IRC10K_EN Mask */

#define CLK_PWRCON_OSC22M_EN_Pos             2                                    /*!< CLK_T::PWRCON: OSC22M_EN Position */
#define CLK_PWRCON_OSC22M_EN_Msk             (1ul << CLK_PWRCON_OSC22M_EN_Pos)    /*!< CLK_T::PWRCON: OSC22M_EN Mask */
#define CLK_PWRCON_IRC22M_EN_Pos             2                                    /*!< CLK_T::PWRCON: IRC22M_EN Position */
#define CLK_PWRCON_IRC22M_EN_Msk             (1ul << CLK_PWRCON_IRC22M_EN_Pos)    /*!< CLK_T::PWRCON: IRC22M_EN Mask */

#define CLK_PWRCON_XTL12M_EN_Pos             0                                    /*!< CLK_T::PWRCON: XTL12M_EN Position */
#define CLK_PWRCON_XTL12M_EN_Msk             (1ul << CLK_PWRCON_XTL12M_EN_Pos)    /*!< CLK_T::PWRCON: XTL12M_EN Mask */

/* CLK AHBCLK Bit Field Definitions */
#define CLK_AHBCLK_HDIV_EN_Pos               4                                    /*!< CLK_T::AHBCLK: HDIV_EN Position */
#define CLK_AHBCLK_HDIV_EN_Msk               (1ul << CLK_AHBCLK_HDIV_EN_Pos)      /*!< CLK_T::AHBCLK: HDIV_EN Mask */

/* CLK APBCLK Bit Field Definitions */

#define CLK_APBCLK_OPA_EN_Pos                29                                   /*!< CLK_T::APBCLK: OPA_EN Position */
#define CLK_APBCLK_OPA_EN_Msk                (1ul << CLK_APBCLK_OPA_EN_Pos)       /*!< CLK_T::APBCLK: OPA_EN Mask */

#define CLK_APBCLK_EADC_EN_Pos               28                                   /*!< CLK_T::APBCLK: EADC_EN Position */
#define CLK_APBCLK_EADC_EN_Msk               (1ul << CLK_APBCLK_EADC_EN_Pos)      /*!< CLK_T::APBCLK: EADC_EN Mask */

#define CLK_APBCLK_ECAP1_EN_Pos              27                                   /*!< CLK_T::APBCLK: ECAP1_EN Position */
#define CLK_APBCLK_ECAP1_EN_Msk              (1ul << CLK_APBCLK_ECAP1_EN_Pos)     /*!< CLK_T::APBCLK: ECAP1_EN Mask */

#define CLK_APBCLK_ECAP0_EN_Pos              26                                   /*!< CLK_T::APBCLK: ECAP0_EN Position */
#define CLK_APBCLK_ECAP0_EN_Msk              (1ul << CLK_APBCLK_ECAP0_EN_Pos)     /*!< CLK_T::APBCLK: ECAP0_EN Mask */

#define CLK_APBCLK_ACMP_EN_Pos               22                                   /*!< CLK_T::APBCLK: ACMP_EN Position */
#define CLK_APBCLK_ACMP_EN_Msk               (1ul << CLK_APBCLK_ACMP_EN_Pos)      /*!< CLK_T::APBCLK: ACMP_EN Mask */

#define CLK_APBCLK_EPWM1_EN_Pos              21                                   /*!< CLK_T::APBCLK: EPWM1_EN Position */
#define CLK_APBCLK_EPWM1_EN_Msk              (1ul << CLK_APBCLK_EPWM1_EN_Pos)     /*!< CLK_T::APBCLK: EPWM1_EN Mask */

#define CLK_APBCLK_EPWM0_EN_Pos              20                                   /*!< CLK_T::APBCLK: EPWM0_EN Position */
#define CLK_APBCLK_EPWM0_EN_Msk              (1ul << CLK_APBCLK_EPWM0_EN_Pos)     /*!< CLK_T::APBCLK: EPWM0_EN Mask */

#define CLK_APBCLK_BPWM0_EN_Pos              19                                   /*!< CLK_T::APBCLK: BPWM0_EN Position */
#define CLK_APBCLK_BPWM0_EN_Msk              (1ul << CLK_APBCLK_BPWM0_EN_Pos)     /*!< CLK_T::APBCLK: BPWM0_EN Mask */

#define CLK_APBCLK_UART1_EN_Pos              17                                   /*!< CLK_T::APBCLK: UART1_EN Position */
#define CLK_APBCLK_UART1_EN_Msk              (1ul << CLK_APBCLK_UART1_EN_Pos)     /*!< CLK_T::APBCLK: UART1_EN Mask */

#define CLK_APBCLK_UART0_EN_Pos              16                                   /*!< CLK_T::APBCLK: UART0_EN Position */
#define CLK_APBCLK_UART0_EN_Msk              (1ul << CLK_APBCLK_UART0_EN_Pos)     /*!< CLK_T::APBCLK: UART0_EN Mask */

