MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
#define EADC_ADSPCR_CHSEL_Pos         0                                       /*!< EADC_T::ADSPCR: CHSEL Position */
#define EADC_ADSPCR_CHSEL_Msk         (7ul << EADC_ADSPCR_CHSEL_Pos)          /*!< EADC_T::ADSPCR: CHSEL Mask */

/* ADSPCRA Bit Field Definitions */
#define EADC_ADSPCRA_EXTFEN_Pos       21                                      /*!< EADC_T::ADSPCRA: EXTFEN Position */
#define EADC_ADSPCRA_EXTFEN_Msk       (1ul << EADC_ADSPCRA_EXTFEN_Pos)        /*!< EADC_T::ADSPCRA: EXTFEN Mask */

#define EADC_ADSPCRA_EXTREN_Pos       20                                      /*!< EADC_T::ADSPCRA: EXTREN Position */
#define EADC_ADSPCRA_EXTREN_Msk       (1ul << EADC_ADSPCRA_EXTREN_Pos)        /*!< EADC_T::ADSPCRA: EXTREN Mask */

#define EADC_ADSPCRA_TRGDLYDIV_Pos    16                                      /*!< EADC_T::ADSPCRA: TRGDLYDIV Position */
#define EADC_ADSPCRA_TRGDLYDIV_Msk    (3ul << EADC_ADSPCRA_TRGDLYDIV_Pos)     /*!< EADC_T::ADSPCRA: TRGDLYDIV Mask */

#define EADC_ADSPCRA_TRGDLYCNT_Pos    8                                       /*!< EADC_T::ADSPCRA: TRGDLYCNT Position */
#define EADC_ADSPCRA_TRGDLYCNT_Msk    (0xFFul << EADC_ADSPCRA_TRGDLYCNT_Pos)  /*!< EADC_T::ADSPCRA: TRGDLYCNT Mask */

#define EADC_ADSPCRA_TRGSEL_Pos       4                                       /*!< EADC_T::ADSPCRA: TRGSEL Position */
#define EADC_ADSPCRA_TRGSEL_Msk       (0xFul << EADC_ADSPCRA_TRGSEL_Pos)      /*!< EADC_T::ADSPCRA: TRGSEL Mask */

#define EADC_ADSPCRA_CHSEL_Pos        0                                       /*!< EADC_T::ADSPCRA: CHSEL Position */
#define EADC_ADSPCRA_CHSEL_Msk        (7ul << EADC_ADSPCRA_CHSEL_Pos)         /*!< EADC_T::ADSPCRA: CHSEL Mask */

/* ADSPCRB Bit Field Definitions */
#define EADC_ADSPCRB_EXTFEN_Pos       21                                      /*!< EADC_T::ADSPCRB: EXTFEN Position */
#define EADC_ADSPCRB_EXTFEN_Msk       (1ul << EADC_ADSPCRB_EXTFEN_Pos)        /*!< EADC_T::ADSPCRB: EXTFEN Mask */

#define EADC_ADSPCRB_EXTREN_Pos       20                                      /*!< EADC_T::ADSPCRB: EXTREN Position */
#define EADC_ADSPCRB_EXTREN_Msk       (1ul << EADC_ADSPCRB_EXTREN_Pos)        /*!< EADC_T::ADSPCRB: EXTREN Mask */

#define EADC_ADSPCRB_TRGDLYDIV_Pos    16                                      /*!< EADC_T::ADSPCRB: TRGDLYDIV Position */
#define EADC_ADSPCRB_TRGDLYDIV_Msk    (3ul << EADC_ADSPCRB_TRGDLYDIV_Pos)     /*!< EADC_T::ADSPCRB: TRGDLYDIV Mask */

#define EADC_ADSPCRB_TRGDLYCNT_Pos    8                                       /*!< EADC_T::ADSPCRB: TRGDLYCNT Position */
#define EADC_ADSPCRB_TRGDLYCNT_Msk    (0xFFul << EADC_ADSPCRB_TRGDLYCNT_Pos)  /*!< EADC_T::ADSPCRB: TRGDLYCNT Mask */

#define EADC_ADSPCRB_TRGSEL_Pos       4                                       /*!< EADC_T::ADSPCRB: TRGSEL Position */
#define EADC_ADSPCRB_TRGSEL_Msk       (0xFul << EADC_ADSPCRB_TRGSEL_Pos)      /*!< EADC_T::ADSPCRB: TRGSEL Mask */

#define EADC_ADSPCRB_CHSEL_Pos        0                                       /*!< EADC_T::ADSPCRB: CHSEL Position */
#define EADC_ADSPCRB_CHSEL_Msk        (7ul << EADC_ADSPCRB_CHSEL_Pos)         /*!< EADC_T::ADSPCRB: CHSEL Mask */

/* ADSMSELR Bit Field Definitions */
#define EADC_ADSMSELR_SIMUSEL_Pos     0                                       /*!< EADC_T::ADSMSELR: SIMUSEL Position */
#define EADC_ADSMSELR_SIMUSEL_Msk     (0xFFul << EADC_ADSMSELR_SIMUSEL_Pos)   /*!< EADC_T::ADSMSELR: SIMUSEL Mask */

/* ADCMPR Bit Field Definitions */
#define EADC_ADCMPR_CMPD_Pos          16                                      /*!< EADC_T::ADCMPR: CMPD Position */
#define EADC_ADCMPR_CMPD_Msk          (0xFFFul << EADC_ADCMPR_CMPD_Pos)       /*!< EADC_T::ADCMPR: CMPD Mask */

#define EADC_ADCMPR_CMPMATCNT_Pos     8                                       /*!< EADC_T::ADCMPR: CMPMATCNT Position */
#define EADC_ADCMPR_CMPMATCNT_Msk     (0xFul << EADC_ADCMPR_CMPMATCNT_Pos)    /*!< EADC_T::ADCMPR: CMPMATCNT Mask */

#define EADC_ADCMPR_CMPSMPL_Pos       3                                       /*!< EADC_T::ADCMPR: CMPSMPL Position */
#define EADC_ADCMPR_CMPSMPL_Msk       (7ul << EADC_ADCMPR_CMPSMPL_Pos)        /*!< EADC_T::ADCMPR: CMPSMPL Mask */

#define EADC_ADCMPR_CMPCOND_Pos       2                                       /*!< EADC_T::ADCMPR: CMPCOND Position */
#define EADC_ADCMPR_CMPCOND_Msk       (1ul << EADC_ADCMPR_CMPCOND_Pos)        /*!< EADC_T::ADCMPR: CMPCOND Mask */

#define EADC_ADCMPR_ADCMPIE_Pos       1                                       /*!< EADC_T::ADCMPR: ADCMPIE Position */
#define EADC_ADCMPR_ADCMPIE_Msk       (1ul << EADC_ADCMPR_ADCMPIE_Pos)        /*!< EADC_T::ADCMPR: ADCMPIE Mask */

#define EADC_ADCMPR_ADCMP_EN_Pos      0                                       /*!< EADC_T::ADCMPR: ADCMP_EN Position */
#define EADC_ADCMPR_ADCMP_EN_Msk      (1ul << EADC_ADCMPR_ADCMP_EN_Pos)       /*!< EADC_T::ADCMPR: ADCMP_EN Mask */

/* ADSR0 Bit Field Definitions */
#define EADC_ADSR0_OVERRUN_Pos        16                                      /*!< EADC_T::ADSR0: OVERRUN Position */
#define EADC_ADSR0_OVERRUN_Msk        (0xFFFFul << EADC_ADSR0_OVERRUN_Pos)    /*!< EADC_T::ADSR0: OVERRUN Mask */

#define EADC_ADSR0_VALID_Pos          0                                       /*!< EADC_T::ADSR0: VALID Position */
#define EADC_ADSR0_VALID_Msk          (0xFFFFul << EADC_ADSR0_VALID_Pos)      /*!< EADC_T::ADSR0: VALID Mask */

/* ADSR1 Bit Field Definitions */
#define EADC_ADSR1_AOVERRUN_Pos       27                                      /*!< EADC_T::ADSR1: AOVERRUN Position */
#define EADC_ADSR1_AOVERRUN_Msk       (1ul << EADC_ADSR1_AOVERRUN_Pos)        /*!< EADC_T::ADSR1: AOVERRUN Mask */

#define EADC_ADSR1_AVALID_Pos         26                                      /*!< EADC_T::ADSR1: AVALID Position */
#define EADC_ADSR1_AVALID_Msk         (1ul << EADC_ADSR1_AVALID_Pos)          /*!< EADC_T::ADSR1: AVALID Mask */

#define EADC_ADSR1_ASPOVF_Pos         25                                      /*!< EADC_T::ADSR1: ASPOVF Position */
#define EADC_ADSR1_ASPOVF_Msk         (1ul << EADC_ADSR1_ASPOVF_Pos)          /*!< EADC_T::ADSR1: ASPOVF Mask */

