MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
#define EADC_ADSR1_AADFOV_Pos         24                                      /*!< EADC_T::ADSR1: AADFOV Position */
#define EADC_ADSR1_AADFOV_Msk         (1ul << EADC_ADSR1_AADFOV_Pos)          /*!< EADC_T::ADSR1: AADFOV Mask */

#define EADC_ADSR1_CHANNELB_Pos       20                                      /*!< EADC_T::ADSR1: CHANNELB Position */
#define EADC_ADSR1_CHANNELB_Msk       (7ul << EADC_ADSR1_CHANNELB_Pos)        /*!< EADC_T::ADSR1: CHANNELB Mask */

#define EADC_ADSR1_BUSYB_Pos          16                                      /*!< EADC_T::ADSR1: BUSYB Position */
#define EADC_ADSR1_BUSYB_Msk          (1ul << EADC_ADSR1_BUSYB_Pos)           /*!< EADC_T::ADSR1: BUSYB Mask */

#define EADC_ADSR1_CHANNELA_Pos       12                                      /*!< EADC_T::ADSR1: CHANNELA Position */
#define EADC_ADSR1_CHANNELA_Msk       (7ul << EADC_ADSR1_CHANNELA_Pos)        /*!< EADC_T::ADSR1: CHANNELA Mask */

#define EADC_ADSR1_BUSYA_Pos          8                                       /*!< EADC_T::ADSR1: BUSYA Position */
#define EADC_ADSR1_BUSYA_Msk          (1ul << EADC_ADSR1_BUSYA_Pos)           /*!< EADC_T::ADSR1: BUSYA Mask */

#define EADC_ADSR1_ADCMPF1_Pos        7                                       /*!< EADC_T::ADSR1: ADCMPF1 Position */
#define EADC_ADSR1_ADCMPF1_Msk        (1ul << EADC_ADSR1_ADCMPF1_Pos)         /*!< EADC_T::ADSR1: ADCMPF1 Mask */

#define EADC_ADSR1_ADCMPF0_Pos        6                                       /*!< EADC_T::ADSR1: ADCMPF0 Position */
#define EADC_ADSR1_ADCMPF0_Msk        (1ul << EADC_ADSR1_ADCMPF0_Pos)         /*!< EADC_T::ADSR1: ADCMPF0 Mask */

#define EADC_ADSR1_ADCMPO1_Pos        5                                       /*!< EADC_T::ADSR1: ADCMPO1 Position */
#define EADC_ADSR1_ADCMPO1_Msk        (1ul << EADC_ADSR1_ADCMPO1_Pos)         /*!< EADC_T::ADSR1: ADCMPO1 Mask */

#define EADC_ADSR1_ADCMPO0_Pos        4                                       /*!< EADC_T::ADSR1: ADCMPO0 Position */
#define EADC_ADSR1_ADCMPO0_Msk        (1ul << EADC_ADSR1_ADCMPO0_Pos)         /*!< EADC_T::ADSR1: ADCMPO0 Mask */

#define EADC_ADSR1_ADF3_Pos           3                                       /*!< EADC_T::ADSR1: ADF3 Position */
#define EADC_ADSR1_ADF3_Msk           (1ul << EADC_ADSR1_ADF3_Pos)            /*!< EADC_T::ADSR1: ADF3 Mask */

#define EADC_ADSR1_ADF2_Pos           2                                       /*!< EADC_T::ADSR1: ADF2 Position */
#define EADC_ADSR1_ADF2_Msk           (1ul << EADC_ADSR1_ADF2_Pos)            /*!< EADC_T::ADSR1: ADF2 Mask */

#define EADC_ADSR1_ADF1_Pos           1                                       /*!< EADC_T::ADSR1: ADF1 Position */
#define EADC_ADSR1_ADF1_Msk           (1ul << EADC_ADSR1_ADF1_Pos)            /*!< EADC_T::ADSR1: ADF1 Mask */

#define EADC_ADSR1_ADF0_Pos           0                                       /*!< EADC_T::ADSR1: ADF0 Position */
#define EADC_ADSR1_ADF0_Msk           (1ul << EADC_ADSR1_ADF0_Pos)            /*!< EADC_T::ADSR1: ADF0 Mask */

/* ADTCR Bit Field Definitions */
#define EADC_ADTCR_ADBEST_Pos         16                                      /*!< EADC_T::ADTCR: ADBEST Position */
#define EADC_ADTCR_ADBEST_Msk         (0xFFul << EADC_ADTCR_ADBEST_Pos)       /*!< EADC_T::ADTCR: ADBEST Mask */

#define EADC_ADTCR_ADAEST_Pos         0                                       /*!< EADC_T::ADTCR: ADAEST Position */
#define EADC_ADTCR_ADAEST_Msk         (0xFFul << EADC_ADTCR_ADAEST_Pos)       /*!< EADC_T::ADTCR: ADAEST Mask */

/* ADDRDB Bit Field Definitions */
#define EADC_ADDRDB_VALID_Pos         16                                      /*!< EADC_T::ADDRDB: VALID Position */
#define EADC_ADDRDB_VALID_Msk         (1ul << EADC_ADDRDB_VALID_Pos)          /*!< EADC_T::ADDRDB: VALID Mask */

#define EADC_ADDRDB_RSLTDB_Pos        0                                       /*!< EADC_T::ADDRDB: RSLTDB Position */
#define EADC_ADDRDB_RSLTDB_Msk        (0xFFFul << EADC_ADDRDB_RSLTDB_Pos)     /*!< EADC_T::ADDRDB: RSLTDB Mask */

/* ADDRDBA Bit Field Definitions */
#define EADC_ADDRDBA_VALID_Pos        16                                      /*!< EADC_T::ADDRDBA: VALID Position */
#define EADC_ADDRDBA_VALID_Msk        (1ul << EADC_ADDRDBA_VALID_Pos)         /*!< EADC_T::ADDRDBA: VALID Mask */

#define EADC_ADDRDBA_RSLTDB_Pos       0                                       /*!< EADC_T::ADDRDBA: RSLTDB Position */
#define EADC_ADDRDBA_RSLTDB_Msk       (0xFFFul << EADC_ADDRDBA_RSLTDB_Pos)    /*!< EADC_T::ADDRDBA: RSLTDB Mask */

/* ADDRDBB Bit Field Definitions */
#define EADC_ADDRDBB_VALID_Pos        16                                      /*!< EADC_T::ADDRDBB: VALID Position */
#define EADC_ADDRDBB_VALID_Msk        (1ul << EADC_ADDRDBB_VALID_Pos)         /*!< EADC_T::ADDRDBB: VALID Mask */

#define EADC_ADDRDBB_RSLTDB_Pos       0                                       /*!< EADC_T::ADDRDBB: RSLTDB Position */
#define EADC_ADDRDBB_RSLTDB_Msk       (0xFFFul << EADC_ADDRDBB_RSLTDB_Pos)    /*!< EADC_T::ADDRDBB: RSLTDB Mask */

/* ADDBM Bit Field Definitions */
#define EADC_ADDBM_DBMB3_Pos          11                                      /*!< EADC_T::ADDBM: DBMB3 Position */
#define EADC_ADDBM_DBMB3_Msk          (1ul << EADC_ADDBM_DBMB3_Pos)           /*!< EADC_T::ADDBM: DBMB3 Mask */

#define EADC_ADDBM_DBMB2_Pos          10                                      /*!< EADC_T::ADDBM: DBMB2 Position */
#define EADC_ADDBM_DBMB2_Msk          (1ul << EADC_ADDBM_DBMB2_Pos)           /*!< EADC_T::ADDBM: DBMB2 Mask */

#define EADC_ADDBM_DBMB1_Pos          9                                       /*!< EADC_T::ADDBM: DBMB1 Position */
#define EADC_ADDBM_DBMB1_Msk          (1ul << EADC_ADDBM_DBMB1_Pos)           /*!< EADC_T::ADDBM: DBMB1 Mask */

#define EADC_ADDBM_DBMB0_Pos          8                                       /*!< EADC_T::ADDBM: DBMB0 Position */
#define EADC_ADDBM_DBMB0_Msk          (1ul << EADC_ADDBM_DBMB0_Pos)           /*!< EADC_T::ADDBM: DBMB0 Mask */

#define EADC_ADDBM_DBMA3_Pos          3                                       /*!< EADC_T::ADDBM: DBMA3 Position */
#define EADC_ADDBM_DBMA3_Msk          (1ul << EADC_ADDBM_DBMA3_Pos)           /*!< EADC_T::ADDBM: DBMA3 Mask */

