MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
#define EADC_ADDBM_DBMA2_Pos          2                                       /*!< EADC_T::ADDBM: DBMA2 Position */
#define EADC_ADDBM_DBMA2_Msk          (1ul << EADC_ADDBM_DBMA2_Pos)           /*!< EADC_T::ADDBM: DBMA2 Mask */

#define EADC_ADDBM_DBMA1_Pos          1                                       /*!< EADC_T::ADDBM: DBMA1 Position */
#define EADC_ADDBM_DBMA1_Msk          (1ul << EADC_ADDBM_DBMA1_Pos)           /*!< EADC_T::ADDBM: DBMA1 Mask */

#define EADC_ADDBM_DBMA0_Pos          0                                       /*!< EADC_T::ADDBM: DBMA0 Position */
#define EADC_ADDBM_DBMA0_Msk          (1ul << EADC_ADDBM_DBMA0_Pos)           /*!< EADC_T::ADDBM: DBMA0 Mask */

/* ADINTSRCTL Bit Field Definitions */
#define EADC_ADINTSRCTL_IESPLB7_Pos   15                                      /*!< EADC_T::ADINTSRCTL: IESPLB7 Position */
#define EADC_ADINTSRCTL_IESPLB7_Msk   (1ul << EADC_ADINTSRCTL_IESPLB7_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLB7 Mask */

#define EADC_ADINTSRCTL_IESPLB6_Pos   14                                      /*!< EADC_T::ADINTSRCTL: IESPLB6 Position */
#define EADC_ADINTSRCTL_IESPLB6_Msk   (1ul << EADC_ADINTSRCTL_IESPLB6_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLB6 Mask */

#define EADC_ADINTSRCTL_IESPLB5_Pos   13                                      /*!< EADC_T::ADINTSRCTL: IESPLB5 Position */
#define EADC_ADINTSRCTL_IESPLB5_Msk   (1ul << EADC_ADINTSRCTL_IESPLB5_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLB5 Mask */

#define EADC_ADINTSRCTL_IESPLB4_Pos   12                                      /*!< EADC_T::ADINTSRCTL: IESPLB4 Position */
#define EADC_ADINTSRCTL_IESPLB4_Msk   (1ul << EADC_ADINTSRCTL_IESPLB4_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLB4 Mask */

#define EADC_ADINTSRCTL_IESPLB3_Pos   11                                      /*!< EADC_T::ADINTSRCTL: IESPLB3 Position */
#define EADC_ADINTSRCTL_IESPLB3_Msk   (1ul << EADC_ADINTSRCTL_IESPLB3_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLB3 Mask */

#define EADC_ADINTSRCTL_IESPLB2_Pos   10                                      /*!< EADC_T::ADINTSRCTL: IESPLB2 Position */
#define EADC_ADINTSRCTL_IESPLB2_Msk   (1ul << EADC_ADINTSRCTL_IESPLB2_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLB2 Mask */

#define EADC_ADINTSRCTL_IESPLB1_Pos   9                                       /*!< EADC_T::ADINTSRCTL: IESPLB1 Position */
#define EADC_ADINTSRCTL_IESPLB1_Msk   (1ul << EADC_ADINTSRCTL_IESPLB1_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLB1 Mask */

#define EADC_ADINTSRCTL_IESPLB0_Pos   8                                       /*!< EADC_T::ADINTSRCTL: IESPLB0 Position */
#define EADC_ADINTSRCTL_IESPLB0_Msk   (1ul << EADC_ADINTSRCTL_IESPLB0_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLB0 Mask */

#define EADC_ADINTSRCTL_IESPLA7_Pos   7                                       /*!< EADC_T::ADINTSRCTL: IESPLA7 Position */
#define EADC_ADINTSRCTL_IESPLA7_Msk   (1ul << EADC_ADINTSRCTL_IESPLA7_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLA7 Mask */

#define EADC_ADINTSRCTL_IESPLA6_Pos   6                                       /*!< EADC_T::ADINTSRCTL: IESPLA6 Position */
#define EADC_ADINTSRCTL_IESPLA6_Msk   (1ul << EADC_ADINTSRCTL_IESPLA6_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLA6 Mask */

#define EADC_ADINTSRCTL_IESPLA5_Pos   5                                       /*!< EADC_T::ADINTSRCTL: IESPLA5 Position */
#define EADC_ADINTSRCTL_IESPLA5_Msk   (1ul << EADC_ADINTSRCTL_IESPLA5_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLA5 Mask */

#define EADC_ADINTSRCTL_IESPLA4_Pos   4                                       /*!< EADC_T::ADINTSRCTL: IESPLA4 Position */
#define EADC_ADINTSRCTL_IESPLA4_Msk   (1ul << EADC_ADINTSRCTL_IESPLA4_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLA4 Mask */

#define EADC_ADINTSRCTL_IESPLA3_Pos   3                                       /*!< EADC_T::ADINTSRCTL: IESPLA3 Position */
#define EADC_ADINTSRCTL_IESPLA3_Msk   (1ul << EADC_ADINTSRCTL_IESPLA3_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLA3 Mask */

#define EADC_ADINTSRCTL_IESPLA2_Pos   2                                       /*!< EADC_T::ADINTSRCTL: IESPLA2 Position */
#define EADC_ADINTSRCTL_IESPLA2_Msk   (1ul << EADC_ADINTSRCTL_IESPLA2_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLA2 Mask */

#define EADC_ADINTSRCTL_IESPLA1_Pos   1                                       /*!< EADC_T::ADINTSRCTL: IESPLA1 Position */
#define EADC_ADINTSRCTL_IESPLA1_Msk   (1ul << EADC_ADINTSRCTL_IESPLA1_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLA1 Mask */

#define EADC_ADINTSRCTL_IESPLA0_Pos   0                                       /*!< EADC_T::ADINTSRCTL: IESPLA0 Position */
#define EADC_ADINTSRCTL_IESPLA0_Msk   (1ul << EADC_ADINTSRCTL_IESPLA0_Pos)    /*!< EADC_T::ADINTSRCTL: IESPLA0 Mask */

/* SMPTRG Bit Field Definitions */
#define EADC_SMPTRG_PWM21CEN_Pos      31                                    /*!< EADC_T::SMPTRG: PWM21CEN Position */
#define EADC_SMPTRG_PWM21CEN_Msk      (1ul << EADC_SMPTRG_PWM21CEN_Pos)     /*!< EADC_T::SMPTRG: PWM21CEN Mask */

#define EADC_SMPTRG_PWM21PEN_Pos      30                                    /*!< EADC_T::SMPTRG: PWM21PEN Position */
#define EADC_SMPTRG_PWM21PEN_Msk      (1ul << EADC_SMPTRG_PWM21PEN_Pos)     /*!< EADC_T::SMPTRG: PWM21PEN Mask */

#define EADC_SMPTRG_PWM21FEN_Pos      29                                    /*!< EADC_T::SMPTRG: PWM21FEN Position */
#define EADC_SMPTRG_PWM21FEN_Msk      (1ul << EADC_SMPTRG_PWM21FEN_Pos)     /*!< EADC_T::SMPTRG: PWM21FEN Mask */

#define EADC_SMPTRG_PWM21REN_Pos      28                                    /*!< EADC_T::SMPTRG: PWM21REN Position */
#define EADC_SMPTRG_PWM21REN_Msk      (1ul << EADC_SMPTRG_PWM21REN_Pos)     /*!< EADC_T::SMPTRG: PWM21REN Mask */

#define EADC_SMPTRG_PWM20CEN_Pos      27                                    /*!< EADC_T::SMPTRG: PWM20CEN Position */
#define EADC_SMPTRG_PWM20CEN_Msk      (1ul << EADC_SMPTRG_PWM20CEN_Pos)     /*!< EADC_T::SMPTRG: PWM20CEN Mask */

#define EADC_SMPTRG_PWM20PEN_Pos      26                                    /*!< EADC_T::SMPTRG: PWM20PEN Position */
#define EADC_SMPTRG_PWM20PEN_Msk      (1ul << EADC_SMPTRG_PWM20PEN_Pos)     /*!< EADC_T::SMPTRG: PWM20PEN Mask */

#define EADC_SMPTRG_PWM20FEN_Pos      25                                    /*!< EADC_T::SMPTRG: PWM20FEN Position */
#define EADC_SMPTRG_PWM20FEN_Msk      (1ul << EADC_SMPTRG_PWM20FEN_Pos)     /*!< EADC_T::SMPTRG: PWM20FEN Mask */

#define EADC_SMPTRG_PWM20REN_Pos      24                                    /*!< EADC_T::SMPTRG: PWM20REN Position */
#define EADC_SMPTRG_PWM20REN_Msk      (1ul << EADC_SMPTRG_PWM20REN_Pos)     /*!< EADC_T::SMPTRG: PWM20REN Mask */

#define EADC_SMPTRG_PWM14CEN_Pos      23                                    /*!< EADC_T::SMPTRG: PWM14CEN Position */
#define EADC_SMPTRG_PWM14CEN_Msk      (1ul << EADC_SMPTRG_PWM14CEN_Pos)     /*!< EADC_T::SMPTRG: PWM14CEN Mask */

