MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
#define EADC_SMPTRGA_PWM00FEN_Pos     1                                     /*!< EADC_T::SMPTRGA: PWM00FEN Position */
#define EADC_SMPTRGA_PWM00FEN_Msk     (1ul << EADC_SMPTRGA_PWM00FEN_Pos)    /*!< EADC_T::SMPTRGA: PWM00FEN Mask */

#define EADC_SMPTRGA_PWM00REN_Pos     0                                     /*!< EADC_T::SMPTRGA: PWM00REN Position */
#define EADC_SMPTRGA_PWM00REN_Msk     (1ul << EADC_SMPTRGA_PWM00REN_Pos)    /*!< EADC_T::SMPTRGA: PWM00REN Mask */

/* SMPTRGB Bit Field Definitions */
#define EADC_SMPTRGB_PWM21CEN_Pos     31                                    /*!< EADC_T::SMPTRGB: PWM21CEN Position */
#define EADC_SMPTRGB_PWM21CEN_Msk     (1ul << EADC_SMPTRGB_PWM21CEN_Pos)    /*!< EADC_T::SMPTRGB: PWM21CEN Mask */

#define EADC_SMPTRGB_PWM21PEN_Pos     30                                    /*!< EADC_T::SMPTRGB: PWM21PEN Position */
#define EADC_SMPTRGB_PWM21PEN_Msk     (1ul << EADC_SMPTRGB_PWM21PEN_Pos)    /*!< EADC_T::SMPTRGB: PWM21PEN Mask */

#define EADC_SMPTRGB_PWM21FEN_Pos     29                                    /*!< EADC_T::SMPTRGB: PWM21FEN Position */
#define EADC_SMPTRGB_PWM21FEN_Msk     (1ul << EADC_SMPTRGB_PWM21FEN_Pos)    /*!< EADC_T::SMPTRGB: PWM21FEN Mask */

#define EADC_SMPTRGB_PWM21REN_Pos     28                                    /*!< EADC_T::SMPTRGB: PWM21REN Position */
#define EADC_SMPTRGB_PWM21REN_Msk     (1ul << EADC_SMPTRGB_PWM21REN_Pos)    /*!< EADC_T::SMPTRGB: PWM21REN Mask */

#define EADC_SMPTRGB_PWM20CEN_Pos     27                                    /*!< EADC_T::SMPTRGB: PWM20CEN Position */
#define EADC_SMPTRGB_PWM20CEN_Msk     (1ul << EADC_SMPTRGB_PWM20CEN_Pos)    /*!< EADC_T::SMPTRGB: PWM20CEN Mask */

#define EADC_SMPTRGB_PWM20PEN_Pos     26                                    /*!< EADC_T::SMPTRGB: PWM20PEN Position */
#define EADC_SMPTRGB_PWM20PEN_Msk     (1ul << EADC_SMPTRGB_PWM20PEN_Pos)    /*!< EADC_T::SMPTRGB: PWM20PEN Mask */

#define EADC_SMPTRGB_PWM20FEN_Pos     25                                    /*!< EADC_T::SMPTRGB: PWM20FEN Position */
#define EADC_SMPTRGB_PWM20FEN_Msk     (1ul << EADC_SMPTRGB_PWM20FEN_Pos)    /*!< EADC_T::SMPTRGB: PWM20FEN Mask */

#define EADC_SMPTRGB_PWM20REN_Pos     24                                    /*!< EADC_T::SMPTRGB: PWM20REN Position */
#define EADC_SMPTRGB_PWM20REN_Msk     (1ul << EADC_SMPTRGB_PWM20REN_Pos)    /*!< EADC_T::SMPTRGB: PWM20REN Mask */

#define EADC_SMPTRGB_PWM14CEN_Pos     23                                    /*!< EADC_T::SMPTRGB: PWM14CEN Position */
#define EADC_SMPTRGB_PWM14CEN_Msk     (1ul << EADC_SMPTRGB_PWM14CEN_Pos)    /*!< EADC_T::SMPTRGB: PWM14CEN Mask */

#define EADC_SMPTRGB_PWM14PEN_Pos     22                                    /*!< EADC_T::SMPTRGB: PWM14PEN Position */
#define EADC_SMPTRGB_PWM14PEN_Msk     (1ul << EADC_SMPTRGB_PWM14PEN_Pos)    /*!< EADC_T::SMPTRGB: PWM14PEN Mask */

#define EADC_SMPTRGB_PWM14FEN_Pos     21                                    /*!< EADC_T::SMPTRGB: PWM14FEN Position */
#define EADC_SMPTRGB_PWM14FEN_Msk     (1ul << EADC_SMPTRGB_PWM14FEN_Pos)    /*!< EADC_T::SMPTRGB: PWM14FEN Mask */

#define EADC_SMPTRGB_PWM14REN_Pos     20                                    /*!< EADC_T::SMPTRGB: PWM14REN Position */
#define EADC_SMPTRGB_PWM14REN_Msk     (1ul << EADC_SMPTRGB_PWM14REN_Pos)    /*!< EADC_T::SMPTRGB: PWM14REN Mask */

#define EADC_SMPTRGB_PWM12CEN_Pos     19                                    /*!< EADC_T::SMPTRGB: PWM12CEN Position */
#define EADC_SMPTRGB_PWM12CEN_Msk     (1ul << EADC_SMPTRGB_PWM12CEN_Pos)    /*!< EADC_T::SMPTRGB: PWM12CEN Mask */

#define EADC_SMPTRGB_PWM12PEN_Pos     18                                    /*!< EADC_T::SMPTRGB: PWM12PEN Position */
#define EADC_SMPTRGB_PWM12PEN_Msk     (1ul << EADC_SMPTRGB_PWM12PEN_Pos)    /*!< EADC_T::SMPTRGB: PWM12PEN Mask */

#define EADC_SMPTRGB_PWM12FEN_Pos     17                                    /*!< EADC_T::SMPTRGB: PWM12FEN Position */
#define EADC_SMPTRGB_PWM12FEN_Msk     (1ul << EADC_SMPTRGB_PWM12FEN_Pos)    /*!< EADC_T::SMPTRGB: PWM12FEN Mask */

#define EADC_SMPTRGB_PWM12REN_Pos     16                                    /*!< EADC_T::SMPTRGB: PWM12REN Position */
#define EADC_SMPTRGB_PWM12REN_Msk     (1ul << EADC_SMPTRGB_PWM12REN_Pos)    /*!< EADC_T::SMPTRGB: PWM12REN Mask */

#define EADC_SMPTRGB_PWM10CEN_Pos     15                                    /*!< EADC_T::SMPTRGB: PWM10CEN Position */
#define EADC_SMPTRGB_PWM10CEN_Msk     (1ul << EADC_SMPTRGB_PWM10CEN_Pos)    /*!< EADC_T::SMPTRGB: PWM10CEN Mask */

#define EADC_SMPTRGB_PWM10PEN_Pos     14                                    /*!< EADC_T::SMPTRGB: PWM10PEN Position */
#define EADC_SMPTRGB_PWM10PEN_Msk     (1ul << EADC_SMPTRGB_PWM10PEN_Pos)    /*!< EADC_T::SMPTRGB: PWM10PEN Mask */

#define EADC_SMPTRGB_PWM10FEN_Pos     13                                    /*!< EADC_T::SMPTRGB: PWM10FEN Position */
#define EADC_SMPTRGB_PWM10FEN_Msk     (1ul << EADC_SMPTRGB_PWM10FEN_Pos)    /*!< EADC_T::SMPTRGB: PWM10FEN Mask */

#define EADC_SMPTRGB_PWM10REN_Pos     12                                    /*!< EADC_T::SMPTRGB: PWM10REN Position */
#define EADC_SMPTRGB_PWM10REN_Msk     (1ul << EADC_SMPTRGB_PWM10REN_Pos)    /*!< EADC_T::SMPTRGB: PWM10REN Mask */

#define EADC_SMPTRGB_PWM04CEN_Pos     11                                    /*!< EADC_T::SMPTRGB: PWM04CEN Position */
#define EADC_SMPTRGB_PWM04CEN_Msk     (1ul << EADC_SMPTRGB_PWM04CEN_Pos)    /*!< EADC_T::SMPTRGB: PWM04CEN Mask */

#define EADC_SMPTRGB_PWM04PEN_Pos     10                                    /*!< EADC_T::SMPTRGB: PWM04PEN Position */
#define EADC_SMPTRGB_PWM04PEN_Msk     (1ul << EADC_SMPTRGB_PWM04PEN_Pos)    /*!< EADC_T::SMPTRGB: PWM04PEN Mask */

#define EADC_SMPTRGB_PWM04FEN_Pos     9                                     /*!< EADC_T::SMPTRGB: PWM04FEN Position */
#define EADC_SMPTRGB_PWM04FEN_Msk     (1ul << EADC_SMPTRGB_PWM04FEN_Pos)    /*!< EADC_T::SMPTRGB: PWM04FEN Mask */

#define EADC_SMPTRGB_PWM04REN_Pos     8                                     /*!< EADC_T::SMPTRGB: PWM04REN Position */
#define EADC_SMPTRGB_PWM04REN_Msk     (1ul << EADC_SMPTRGB_PWM04REN_Pos)    /*!< EADC_T::SMPTRGB: PWM04REN Mask */

#define EADC_SMPTRGB_PWM02CEN_Pos     7                                     /*!< EADC_T::SMPTRGB: PWM02CEN Position */
#define EADC_SMPTRGB_PWM02CEN_Msk     (1ul << EADC_SMPTRGB_PWM02CEN_Pos)    /*!< EADC_T::SMPTRGB: PWM02CEN Mask */

#define EADC_SMPTRGB_PWM02PEN_Pos     6                                     /*!< EADC_T::SMPTRGB: PWM02PEN Position */
#define EADC_SMPTRGB_PWM02PEN_Msk     (1ul << EADC_SMPTRGB_PWM02PEN_Pos)    /*!< EADC_T::SMPTRGB: PWM02PEN Mask */

#define EADC_SMPTRGB_PWM02FEN_Pos     5                                     /*!< EADC_T::SMPTRGB: PWM02FEN Position */
#define EADC_SMPTRGB_PWM02FEN_Msk     (1ul << EADC_SMPTRGB_PWM02FEN_Pos)    /*!< EADC_T::SMPTRGB: PWM02FEN Mask */

#define EADC_SMPTRGB_PWM02REN_Pos     4                                     /*!< EADC_T::SMPTRGB: PWM02REN Position */
#define EADC_SMPTRGB_PWM02REN_Msk     (1ul << EADC_SMPTRGB_PWM02REN_Pos)    /*!< EADC_T::SMPTRGB: PWM02REN Mask */

#define EADC_SMPTRGB_PWM00CEN_Pos     3                                     /*!< EADC_T::SMPTRGB: PWM00CEN Position */
#define EADC_SMPTRGB_PWM00CEN_Msk     (1ul << EADC_SMPTRGB_PWM00CEN_Pos)    /*!< EADC_T::SMPTRGB: PWM00CEN Mask */

#define EADC_SMPTRGB_PWM00PEN_Pos     2                                     /*!< EADC_T::SMPTRGB: PWM00PEN Position */
#define EADC_SMPTRGB_PWM00PEN_Msk     (1ul << EADC_SMPTRGB_PWM00PEN_Pos)    /*!< EADC_T::SMPTRGB: PWM00PEN Mask */

#define EADC_SMPTRGB_PWM00FEN_Pos     1                                     /*!< EADC_T::SMPTRGB: PWM00FEN Position */
#define EADC_SMPTRGB_PWM00FEN_Msk     (1ul << EADC_SMPTRGB_PWM00FEN_Pos)    /*!< EADC_T::SMPTRGB: PWM00FEN Mask */

#define EADC_SMPTRGB_PWM00REN_Pos     0                                     /*!< EADC_T::SMPTRGB: PWM00REN Position */
#define EADC_SMPTRGB_PWM00REN_Msk     (1ul << EADC_SMPTRGB_PWM00REN_Pos)    /*!< EADC_T::SMPTRGB: PWM00REN Mask */

/*@}*/ /* end of group EADC_CONST */
/*@}*/ /* end of group EADC */



/*---------------------- Enhanced Pulse Width Modulation Controller -------------------------*/
/**
    @addtogroup Enhanced PWM Pulse Width Modulation Controller (EPWM)
    Memory Mapped Structure for EPWM Controller
@{ */

typedef struct
{


