MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
    /**
     * @var EPWM_T::PWMCON
     * Offset: 0x00  EPWM Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits     |Field     |Descriptions
     * | :----:  | :----:   | :---- |
     * |[1:0]    |PWMMOD    |PWM Mode Selection
     * |         |          |00 = Independent mode.
     * |         |          |01 = Pair/Complementary mode.
     * |         |          |10 = Synchronized mode.
     * |         |          |11 = Reserved.
     * |[3:2]    |PWMDIV    |PWM Clock Pre-Divider Selection
     * |         |          |00 = PWM clock = EPWMx_CLK.
     * |         |          |01 = PWM clock = EPWMx_CLK/2.
     * |         |          |10 = PWM clock = EPWMx_CLK/4.
     * |         |          |11 = PWM clock = EPWMx_CLK/16.
     * |[4]      |PWMI_EN   |Enable PWM Interrupt
     * |         |          |0 = Flag PWMF Disabled to trigger PWM interrupt.
     * |         |          |1 = Flag PWMF Enabled to trigger PWM interrupt.
     * |[5]      |BRKI_EN   |Enable Brake0 And Brak1 Interrupt
     * |         |          |0 = Flags BFK0 and BFK1 Disabled to trigger PWM interrupt.
     * |         |          |1 = Flags BKF0 and BKF1 Enabled to trigger PWM interrupt.
     * |[6]      |LOAD      |Reload PWM Period Registers (PWMP) And PWM Duty Registers (PWM0~3) Control Bit
     * |         |          |0 = No action if written with 0. The value of PWM period register (PWMP) and PWM duty
     * |         |          |registers (PWMn0~PWMn3) are not loaded to PWM counter and Comparator registers.
     * |         |          |1 = Hardware will update the value of PWM period register (PWMP) and PWM duty
     * |         |          |registers (PWMn0~PWMn3) to PWM Counter and Comparator register at the time of PWM
     * |         |          |Counter matches PWMP in Edge- and Center-aligned modes or at the time of PWM
     * |         |          |Counter down counts with underflow in Center-aligned mode.
     * |         |          |Note1: n=0-1 for PWM unit0-1.
     * |         |          |Note2: This bit is written by software, cleared by hardware, and always read as 0.
     * |[7]      |PWMRUN    |Start PWMRUN Control Bit
     * |         |          |0 = The PWM stops running.
     * |         |          |1 = The PWM counter starts running.
     * |[8]      |INT_TYPE  |PWM Interrupt Type Selection Bit
     * |         |          |0 = PWMF will be set if PWM counter underflow.
     * |         |          |1 = PWMF will be set if PWM counter matches PWMP register.
     * |         |          |Note: This bit is effective when PWM is in Center-aligned mode only.
     * |[9]      |PWMINV    |Inverse PWM Comparator Output
     * |         |          |When PWMINV is set to high the PWM comparator output signals will be inverted,
     * |         |          |therefore the PWM Duty (in percentage) is changed to (1-Duty) before PWMINV is set to
     * |         |          |high.
     * |         |          |0 = Not inverse PWM comparator output.
     * |         |          |1 = Inverse PWM comparator output.
     * |[11]     |CLRPWM    |Clear PWM Counter Control Bit
     * |         |          |1 = Clear 16-bit PWM counter to 000H.
     * |         |          |Note: It is automatically cleared by hardware.
     * |[12]     |PWMTYPE   |PWM Aligned Type Selection Bit
     * |         |          |0 = Edge-aligned type.
     * |         |          |1 = Center-aligned type.
     * |[13]     |GRP       |Group Bit
     * |         |          |0 = The signals timing of PWM0, PWM2 and PWM4 are independent.
     * |         |          |1 = Unify the signals timing of PWM0, PWM2 and PWM4 in the same phase which is
     * |         |          |controlled by PWM0.
     * |[14]     |INVBKP0   |Inverse BKP0 State
     * |         |          |0 = The state of pin BKPx0 is passed to the negative edge detector.
     * |         |          |1 = The inverted state of pin BKPx0 is passed to the negative edge detector.
     * |[15]     |INVBKP1   |Inverse BKP1 State
     * |         |          |0 = The state of pin BKPx1 is passed to the negative edge detector.
     * |         |          |1 = The inverted state of pin BKPx1 is passed to the negative edge detector.
     * |[16]     |BK0_EN    |BKPx0 Pin Trigger Brake Function 0 Enable
     * |         |          |0 = PWMx Brake Function 0 Disabled.
     * |         |          |1 = PWMx Brake Function 0 Enabled.
     * |         |          |Note: x = 0~1 for PWM unit0~1.
     * |[17]     |BK1_EN    |BKPx1 Pin Trigger Brake Function 1 Enable
     * |         |          |0 = PWMx Brake Function 1 Disabled.
     * |         |          |1 = PWMx Brake Function 1 Enabled.
     * |         |          |Note: x=0~1 for PWM unit0~1.
     * |[19:18]  |BK1SEL    |Brake Function 1 Source Selection
     * |         |          |00 = From external pin BKPx1 (x=0~1 for unit0~1).
     * |         |          |01 = From analog comparator 0 output (CPO0).
     * |         |          |10 = From analog comparator 1 output (CPO1).
     * |         |          |11 = From analog comparator 2 output (CPO2).
     * |[21:20]  |BK0FILT   |Brake 0 (BKPx0 Pin) Edge Detector Filter Clock Selection
     * |         |          |00 = Filter clock = HCLK.
     * |         |          |01 = Filter clock = HCLK/2.
     * |         |          |10 = Filter clock = HCLK/4.
     * |         |          |11 = Filter clock = HCLK/16.
     * |[23:22]  |BK1FILT   |Brake 1 (BKPx1 Pin) Edge Detector Filter Clock Selection
     * |         |          |00 = Filter clock = HCLK.
     * |         |          |01 = Filter clock = HCLK/2.
     * |         |          |10 = Filter clock = HCLK/4.
     * |         |          |11 = Filter clock = HCLK/16.
     * |[24]     |CPO0BK_EN |Enable CPO0 Digital Output As Brake0 Source
     * |         |          |0 = CPO0 as one brake source in Brake 0 Disabled.
     * |         |          |1 = CPO0 as one brake source in Brake 0 Enabled.
     * |[25]     |CPO1BK_EN |Enable CPO1 Digital Output As Brake 0 Source
     * |         |          |0 = CPO1 as one brake source in Brake 0 Disabled.
     * |         |          |1 = CPO1 as one brake source in Brake 0 Enabled.
     * |[26]     |CPO2BK_EN |CPO2 Digital Output As Brake 0 Source Enable
     * |         |          |0 = CPO2 as one brake source in Brake 0 Disabled.
     * |         |          |1 = CPO2 as one brake source in Brake 0 Enabled.
     * |[27]     |LVDBK_EN  |Low-Level Detection Trigger PWM Brake Function 1 Enable
     * |         |          |0 = Brake Function 1 triggered by Low-level detection Disabled.
     * |         |          |1 = Brake Function 1 triggered by Low-level detection Enabled.
     * |[28]     |BK0NF_DIS |PWM Brake 0 Noise Filter Disable
     * |         |          |0 = Noise filter of PWM Brake 0 Enabled.
     * |         |          |1 = Noise filter of PWM Brake 0 Disabled.
     * |[29]     |BK1NF_DIS |PWM Brake 1 Noise Filter Disable
     * |         |          |0 = Noise filter of PWM Brake 1 Enabled.
     * |         |          |1 = Noise filter of PWM Brake 1 Disabled.
     * |[31]     |CLDMD     |Center Reload Mode Enable
     * |         |          |0 = EPWM reload duty register at the period point of PWM counter.
     * |         |          |1 = EPWM reload duty register at the center point of PWM counter.
     * |         |          |Note: This bit only works when EPWM operating in Center-aligned mode.
     * @var EPWM_T::PWMSTS
     * Offset: 0x04  EPWM Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits      |Field     |Descriptions
     * | :----:   | :----:   | :---- |
     * |[0]       |BKF0      |PWM Brake0 Flag
     * |          |          |0 = PWM Brake 0 is able to poll falling signal at BKP0 and has not recognized any one.
     * |          |          |1 = When PWM Brake 0 detects a falling signal at BKP0, this flag will be set to high.
     * |          |          |Note: This bit must be cleared by writing 1 to itself through software.
     * |[1]       |BKF1      |PWM Brake1 Flag
     * |          |          |0 = PWM Brake 1 is able to poll falling signal at BKP1 and has not recognized any one.
     * |          |          |1 = When PWM Brake 1 detects a falling signal at pin BKP1, this flag will be set to high.
     * |          |          |Note: This bit must be cleared by writing 1 to itself through software.
     * |[2]       |PWMF      |PWM Period Flag
     * |          |          |0 = The PWM Counter has not up counted to the value of PWMP or down counted with underflow.
     * |          |          |1 = Hardware will set this flag to high at the time of PWM Counter matches PWMP in Edge-
     * |          |          |and Center-aligned modes or at the time of PWM Counter down counts with underflow in
     * |          |          |Center-aligned mode.
     * |          |          |Note: This bit must be cleared by writing 1 to itself through software.
     * |[4]       |PWM0EF    |PWMx0 Edge Flag
     * |          |          |0 = PWMx0 not toggled.
     * |          |          |1 = Hardware will set this flag to high at the time of PWMx0 rising or falling. If EINT0_TYPE =
     * |          |          |0, this bit is set when PWMx0 falling is detected. If EINT0_TYPE = 1, this bit is set when
     * |          |          |PWMx0 rising is detected.
     * |          |          |Note: This bit must be cleared by writing 1 to itself through software.
     * |[5]       |PWM2EF    |PWMx2 Edge Flag
     * |          |          |0 = PWMx2 not toggled.
     * |          |          |1 = Hardware will set this flag to high at the time of PWMx2 rising or falling. If EINT2_TYPE =
     * |          |          |0, this bit is set when PWMx2 falling is detected. If EINT2_TYPE = 1, this bit is set when
     * |          |          |PWMx2 rising is detected.
     * |          |          |Note: This bit must be cleared by writing 1 to itself through software.
     * |[6]       |PWM4EF    |PWMx4 Edge Flag
     * |          |          |0 = PWMx4 not toggled.
     * |          |          |1 = Hardware will set this flag to high at the time of PWMx4 rising or falling. If EINT4_TYPE =
     * |          |          |0, this bit is set when PWMx4 falling is detected. If EINT4_TYPE = 1, this bit is set when
     * |          |          |PWMx4 rising is detected.
     * |          |          |Note: This bit must be cleared by writing 1 to itself through software.
     * |[8]       |BKLK0     |PWM Brake0 Locked
     * |          |          |0 = Brake 0 state is released.
     * |          |          |1 = When PWM Brake detects a falling signal at BKP0, this flag will be set to high to indicate
     * |          |          |the Brake0 state is locked.
     * |          |          |Note: This bit must be cleared by writing 1 to itself through software.
     * |[24]      |BK0STS    |Brake 0 Status (Read Only)
     * |          |          |0 = PWM had been out of Brake 0 state.
     * |          |          |1 = PWM is in Brake 0 state.
     * |[25]      |BK1STS    |Brake 1 Status (Read Only)
     * |          |          |0 = PWM had been out of Brake 1 state.
     * |          |          |1 = PWM is in Brake 1 state.
     * @var EPWM_T::PWMP
     * Offset: 0x08  EPWM Period Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits     |Field         |Descriptions
     * | :----:  | :----:       | :---- |
     * |[15:0]   |PWMP          |PWM Period Register
     * |         |              |Edge-aligned:
     * |         |              |Period = (PWMP + 1) * EPWMx_CLK period/pre-scalar.
     * |         |              |Duty = (Duty + 1) * EPWMx_CLK period /pre-scalar.
     * |         |              |Center-aligned:
     * |         |              |Period = (PWMP * 2) * EPWMx_CLK period/pre-scalar.
     * |         |              |Duty = (Duty * 2 + 1) * EPWMx_CLK period/pre-scalar.
     * @var EPWM_T::PWM0
     * Offset: 0x0C  EPWM PWM0 Duty Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PWM_Duty  |PWM Duty Register
     * |        |          |Edge-aligned:
     * |        |          |Period = (PWMP + 1) * EPWMx_CLK period/pre-scalar.
     * |        |          |Duty = (Duty + 1) * EPWMx_CLK period /pre-scalar.
     * |        |          |Center-aligned:
     * |        |          |Period = (PWMP * 2) * EPWMx_CLK period/pre-scalar.
     * |        |          |Duty = (Duty * 2 + 1) * EPWMx_CLK period/pre-scalar.
     * @var EPWM_T::PWM2
     * Offset: 0x10  EPWM PWM2 Duty Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PWM_Duty  |PWM Duty Register
     * |        |          |Edge-aligned:
     * |        |          |Period = (PWMP + 1) * EPWMx_CLK period/pre-scalar.
     * |        |          |Duty = (Duty + 1) * EPWMx_CLK period /pre-scalar.
     * |        |          |Center-aligned:
     * |        |          |Period = (PWMP * 2) * EPWMx_CLK period/pre-scalar.
     * |        |          |Duty = (Duty * 2 + 1) * EPWMx_CLK period/pre-scalar.
     * @var EPWM_T::PWM4
     * Offset: 0x14  EPWM PWM4 Duty Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[15:0]  |PWM_Duty  |PWM Duty Register
     * |        |          |Edge-aligned:
     * |        |          |Period = (PWMP + 1) * EPWMx_CLK period/pre-scalar.
     * |        |          |Duty = (Duty + 1) * EPWMx_CLK period /pre-scalar.
     * |        |          |Center-aligned:
     * |        |          |Period = (PWMP * 2) * EPWMx_CLK period/pre-scalar.
     * |        |          |Duty = (Duty * 2 + 1) * EPWMx_CLK period/pre-scalar.
     * @var EPWM_T::PMSKE
     * Offset: 0x18  EPWM Mask Mode Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |PMSKE     |PWM Mask Enable Bit
     * |        |          |The PWM generator signal will be masked when this bit is enabled. The corresponding
     * |        |          |PWMn channel will be output with PMD.n data.
     * |        |          |0 = PWM generator signal is output to next stage.
     * |        |          |1 = PWM generator signal is masked and PMD.n is output to next stage.
     * |        |          |Note: n = 0~5.
     * @var EPWM_T::PMSKD
     * Offset: 0x1C  EPWM Mask Mode Data Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |PMSKD     |PWM Mask Data Bit
     * |        |          |This data bit control the state of PWMn output pin, if corresponding PME.n = 1.
     * |        |          |0 = Output logic low to PWMn.
     * |        |          |1 = Output logic high to PWMn.
     * |        |          |Note: n = 0~5.
     * @var EPWM_T::PDTC
     * Offset: 0x2C  EPWM Dead-time Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[10:0]  |DTCNT     |Dead-Time Counter
     * |        |          |The dead-time can be calculated according to the following formula:
     * |        |          |Dead-time = EPWMx_CLK * (DTCNT.[10:0]+1).
     * |[16]    |DTEN0     |Enable Dead-Time Insertion For PWMx Pair (PWM0, PWM1)
     * |        |          |Dead-time insertion is only active when this pair of complementary PWM is enabled. If dead-
     * |        |          |time insertion is inactive, the outputs of pin pair are complementary without any delay.
     * |        |          |0 = Dead-time insertion Disabled on the pin pair (PWM0, PWM1).
     * |        |          |1 = Dead-time insertion Enabled on the pin pair (PWM0, PWM1).
     * |        |          |Note: x=0~1 for PWM unit0~1.
     * |[17]    |DTEN2     |Enable Dead-Time Insertion For PWMx Pair (PWM2, PWM3)
     * |        |          |Dead-time insertion is only active when this pair of complementary PWM is enabled. If dead-
     * |        |          |time insertion is inactive, the outputs of pin pair are complementary without any delay.
     * |        |          |0 = Dead-time insertion Disabled on the pin pair (PWM2, PWM3).
     * |        |          |1 = Dead-time insertion Enabled on the pin pair (PWM2, PWM3).
     * |        |          |Note: x=2~3 for PWM unit0~1.
     * |[18]    |DTEN4     |Enable Dead-Time Insertion For PWMx Pair (PWM4, PWM5)
     * |        |          |Dead-time insertion is only active when this pair of complementary PWM is enabled. If dead-
     * |        |          |time insertion is inactive, the outputs of pin pair are complementary without any delay.
     * |        |          |0 = Dead-time insertion Disabled on the pin pair (PWM4, PWM5).
     * |        |          |1 = Dead-time insertion Enabled on the pin pair (PWM4, PWM5).
     * |        |          |Note: x=4~5 for PWM unit0~1.
     * @var EPWM_T::PWMB
     * Offset: 0x30  EPWM Brake Output
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |PWMB      |PWM Brake Output
     * |        |          |When PWM Brake is asserted, the PWM0~5 output state before polarity control will follow
     * |        |          |PWMB bit0~5 setting, respectively.
     * |        |          |0 = PWMn output before polarity control is low when Brake is asserted.
     * |        |          |1 = PWMn output before polarity control is high when Brake is asserted.
     * |        |          |Note: n = 0~5.
     * @var EPWM_T::PNPC
     * Offset: 0x34  EPWM Negative Polarity Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |PNPn      |PWM Negative Polarity Control
     * |        |          |The register bit controls polarity/active state of real PWM output.
     * |        |          |0 = PWMn output is active high.
     * |        |          |1 = PWMn output is active low.
     * |        |          |Note: n = 0~5.
     * @var EPWM_T::PWMFCNT
     * Offset: 0x3C  EPWMF Compared Counter
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |PWMFCNT   |PWMF Compared Counter
     * |        |          |The register sets the count number which defines how many times of PWM period occurs to
     * |        |          |set bit PWMF to request the PWM period interrupt.
     * |        |          |PWMF will be set in every (1 + PWMFCNT[3:0]) time of PWM period or center point defined
     * |        |          |by INT_TYPE at PWMCON[8] occurs.
     * @var EPWM_T::PWMEIC
     * Offset: 0x40  EPWM Edge Interrupt Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PWM0EI_EN |Enable PWMx0 Edge Interrupt
     * |        |          |0 = Flag PWM0EF Disabled to trigger PWM interrupt.
     * |        |          |1 = Flag PWM0EF Enabled to trigger PWM interrupt.
     * |[1]     |PWM2EI_EN |Enable PWMx2 Edge Interrupt
     * |        |          |0 = Flag PWM2EF Disabled to trigger PWM interrupt.
     * |        |          |1 = Flag PWM2EF Enabled to trigger PWM interrupt.
     * |[2]     |PWM4EI_EN |Enable PWMx4 Edge Interrupt
     * |        |          |0 = Flag PWM4EF Disabled to trigger PWM interrupt.
     * |        |          |1 = Flag PWM4EF Enabled to trigger PWM interrupt.
     * |[8]     |EINT0_TYPE|PWMx0 Edge Interrupt Type
     * |        |          |0 = PWM0EF will be set if falling edge is detected at PWMx0.
     * |        |          |1 = PWM0EF will be set if rising edge is detected at PWMx0.
     * |[9]     |EINT2_TYPE|PWMx2 Edge Interrupt Type
     * |        |          |0 = PWM2EF will be set if falling edge is detected at PWMx2.
     * |        |          |1 = PWM2EF will be set if rising edge is detected at PWMx2.
     * |[10]    |EINT4_TYPE|PWMx4 Edge Interrupt Type
     * |        |          |0 = PWM4EF will be set if falling edge is detected at PWMx4.
     * |        |          |1 = PWM4EF will be set if rising edge is detected at PWMx4.
     */

    __IO uint32_t PWMCON;        /* Offset: 0x00  EPWM Control Register                                              */
    __IO uint32_t PWMSTS;        /* Offset: 0x04  EPWM Status Register                                               */
    __IO uint32_t PWMP;          /* Offset: 0x08  EPWM Period Register                                               */
    __IO uint32_t PWM0;          /* Offset: 0x0C  EPWM PWM0 Duty Register                                            */
    __IO uint32_t PWM2;          /* Offset: 0x10  EPWM PWM2 Duty Register                                            */
    __IO uint32_t PWM4;          /* Offset: 0x14  EPWM PWM4 Duty Register                                            */
    __IO uint32_t PMSKE;         /* Offset: 0x18  EPWM Mask Mode Enable Register                                     */
    __IO uint32_t PMSKD;         /* Offset: 0x1C  EPWM Mask Mode Data Register                                       */
    __I  uint32_t RESERVE0[3];
    __IO uint32_t PDTC;          /* Offset: 0x2C  EPWM Dead-time Control Register                                    */
    __IO uint32_t PWMB;          /* Offset: 0x30  EPWM Brake Output                                                  */
    __IO uint32_t PNPC;          /* Offset: 0x34  EPWM Negative Polarity Control                                     */
    __I  uint32_t RESERVE1[1];
    __IO uint32_t PWMFCNT;       /* Offset: 0x3C  EPWMF Compared Counter                                             */
    __IO uint32_t PWMEIC;        /* Offset: 0x40  EPWM Edge Interrupt Control Register                               */

} EPWM_T;



/**
    @addtogroup EPWM_CONST EPWM Bit Field Definition
    Constant Definitions for EPWM Controller
@{ */

