MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
/* EPWM PWMCON Bit Field Definitions */
#define EPWM_PWMCON_CLDMD_Pos                    31                                     /*!< EPWM_T::PWMCON: CLDMD Position */
#define EPWM_PWMCON_CLDMD_Msk                    (0x1ul << EPWM_PWMCON_CLDMD_Pos)       /*!< EPWM_T::PWMCON: CLDMD Mask */

#define EPWM_PWMCON_AUTOLD_Pos                   30                                     /*!< EPWM_T::PWMCON: AUTOLD Position */
#define EPWM_PWMCON_AUTOLD_Msk                   (0x1ul << EPWM_PWMCON_AUTOLD_Pos)      /*!< EPWM_T::PWMCON: AUTOLD Mask */

#define EPWM_PWMCON_BK1NF_DIS_Pos                29                                     /*!< EPWM_T::PWMCON: BK1NF_DIS Position */
#define EPWM_PWMCON_BK1NF_DIS_Msk                (0x1ul << EPWM_PWMCON_BK1NF_DIS_Pos)   /*!< EPWM_T::PWMCON: BK1NF_DIS Mask */

#define EPWM_PWMCON_BK0NF_DIS_Pos                28                                     /*!< EPWM_T::PWMCON: BK0NF_DIS Position */
#define EPWM_PWMCON_BK0NF_DIS_Msk                (0x1ul << EPWM_PWMCON_BK0NF_DIS_Pos)   /*!< EPWM_T::PWMCON: BK0NF_DIS Mask */

#define EPWM_PWMCON_LVDBK_EN_Pos                 27                                     /*!< EPWM_T::PWMCON: LVDBK_EN Position */
#define EPWM_PWMCON_LVDBK_EN_Msk                 (0x1ul << EPWM_PWMCON_LVDBK_EN_Pos)    /*!< EPWM_T::PWMCON: LVDBK_EN Mask */

#define EPWM_PWMCON_CPO2BK_EN_Pos                26                                     /*!< EPWM_T::PWMCON: CPO2BK_EN Position */
#define EPWM_PWMCON_CPO2BK_EN_Msk                (0x1ul << EPWM_PWMCON_CPO2BK_EN_Pos)   /*!< EPWM_T::PWMCON: CPO2BK_EN Mask */

#define EPWM_PWMCON_CPO1BK_EN_Pos                25                                     /*!< EPWM_T::PWMCON: CPO1BK_EN Position */
#define EPWM_PWMCON_CPO1BK_EN_Msk                (0x1ul << EPWM_PWMCON_CPO1BK_EN_Pos)   /*!< EPWM_T::PWMCON: CPO1BK_EN Mask */

#define EPWM_PWMCON_CPO0BK_EN_Pos                24                                     /*!< EPWM_T::PWMCON: CPO0BK_EN Position */
#define EPWM_PWMCON_CPO0BK_EN_Msk                (0x1ul << EPWM_PWMCON_CPO0BK_EN_Pos)   /*!< EPWM_T::PWMCON: CPO0BK_EN Mask */

#define EPWM_PWMCON_BK1FILT_Pos                  22                                     /*!< EPWM_T::PWMCON: BK1FILT Position */
#define EPWM_PWMCON_BK1FILT_Msk                  (0x3ul << EPWM_PWMCON_BK1FILT_Pos)     /*!< EPWM_T::PWMCON: BK1FILT Mask */

#define EPWM_PWMCON_BK0FILT_Pos                  20                                     /*!< EPWM_T::PWMCON: BK0FILT Position */
#define EPWM_PWMCON_BK0FILT_Msk                  (0x3ul << EPWM_PWMCON_BK0FILT_Pos)     /*!< EPWM_T::PWMCON: BK0FILT Mask */

#define EPWM_PWMCON_BK1SEL_Pos                   18                                     /*!< EPWM_T::PWMCON: BK1SEL Position */
#define EPWM_PWMCON_BK1SEL_Msk                   (0x3ul << EPWM_PWMCON_BK1SEL_Pos)      /*!< EPWM_T::PWMCON: BK1SEL Mask */

#define EPWM_PWMCON_BK1_EN_Pos                   17                                     /*!< EPWM_T::PWMCON: BK1_EN Position */
#define EPWM_PWMCON_BK1_EN_Msk                   (0x1ul << EPWM_PWMCON_BK1_EN_Pos)      /*!< EPWM_T::PWMCON: BK1_EN Mask */

#define EPWM_PWMCON_BK0_EN_Pos                   16                                     /*!< EPWM_T::PWMCON: BK0_EN Position */
#define EPWM_PWMCON_BK0_EN_Msk                   (0x1ul << EPWM_PWMCON_BK0_EN_Pos)      /*!< EPWM_T::PWMCON: BK0_EN Mask */

#define EPWM_PWMCON_INVBKP1_Pos                  15                                     /*!< EPWM_T::PWMCON: INVBKP1 Position */
#define EPWM_PWMCON_INVBKP1_Msk                  (0x1ul << EPWM_PWMCON_INVBKP1_Pos)     /*!< EPWM_T::PWMCON: INVBKP1 Mask */

#define EPWM_PWMCON_INVBKP0_Pos                  14                                     /*!< EPWM_T::PWMCON: INVBKP0 Position */
#define EPWM_PWMCON_INVBKP0_Msk                  (0x1ul << EPWM_PWMCON_INVBKP0_Pos)     /*!< EPWM_T::PWMCON: INVBKP0 Mask */

#define EPWM_PWMCON_GRP_Pos                      13                                     /*!< EPWM_T::PWMCON: GRP Position */
#define EPWM_PWMCON_GRP_Msk                      (0x1ul << EPWM_PWMCON_GRP_Pos)         /*!< EPWM_T::PWMCON: GRP Mask */

#define EPWM_PWMCON_PWMTYPE_Pos                  12                                     /*!< EPWM_T::PWMCON: PWMTYPE Position */
#define EPWM_PWMCON_PWMTYPE_Msk                  (0x1ul << EPWM_PWMCON_PWMTYPE_Pos)     /*!< EPWM_T::PWMCON: PWMTYPE Mask */

#define EPWM_PWMCON_CLRPWM_Pos                   11                                     /*!< EPWM_T::PWMCON: CLRPWM Position */
#define EPWM_PWMCON_CLRPWM_Msk                   (0x1ul << EPWM_PWMCON_CLRPWM_Pos)      /*!< EPWM_T::PWMCON: CLRPWM Mask */

#define EPWM_PWMCON_PWMINV_Pos                   9                                      /*!< EPWM_T::PWMCON: PWMINV Position */
#define EPWM_PWMCON_PWMINV_Msk                   (0x1ul << EPWM_PWMCON_PWMINV_Pos)      /*!< EPWM_T::PWMCON: PWMINV Mask */

#define EPWM_PWMCON_INT_TYPE_Pos                 8                                      /*!< EPWM_T::PWMCON: INT_TYPE Position */
#define EPWM_PWMCON_INT_TYPE_Msk                 (0x1ul << EPWM_PWMCON_INT_TYPE_Pos)    /*!< EPWM_T::PWMCON: INT_TYPE Mask */

#define EPWM_PWMCON_PWMRUN_Pos                   7                                      /*!< EPWM_T::PWMCON: PWMRUN Position */
#define EPWM_PWMCON_PWMRUN_Msk                   (0x1ul << EPWM_PWMCON_PWMRUN_Pos)      /*!< EPWM_T::PWMCON: PWMRUN Mask */

#define EPWM_PWMCON_LOAD_Pos                     6                                      /*!< EPWM_T::PWMCON: LOAD Position */
#define EPWM_PWMCON_LOAD_Msk                     (0x1ul << EPWM_PWMCON_LOAD_Pos)        /*!< EPWM_T::PWMCON: LOAD Mask */

#define EPWM_PWMCON_BRKI_EN_Pos                  5                                      /*!< EPWM_T::PWMCON: BRKI_EN Position */
#define EPWM_PWMCON_BRKI_EN_Msk                  (0x1ul << EPWM_PWMCON_BRKI_EN_Pos)     /*!< EPWM_T::PWMCON: BRKI_EN Mask */

#define EPWM_PWMCON_PWMI_EN_Pos                  4                                      /*!< EPWM_T::PWMCON: PWMI_EN Position */
#define EPWM_PWMCON_PWMI_EN_Msk                  (0x1ul << EPWM_PWMCON_PWMI_EN_Pos)     /*!< EPWM_T::PWMCON: PWMI_EN Mask */

#define EPWM_PWMCON_PWMDIV_Pos                   2                                      /*!< EPWM_T::PWMCON: PWMDIV Position */
#define EPWM_PWMCON_PWMDIV_Msk                   (0x3ul << EPWM_PWMCON_PWMDIV_Pos)      /*!< EPWM_T::PWMCON: PWMDIV Mask */

#define EPWM_PWMCON_PWMMOD_Pos                   0                                      /*!< EPWM_T::PWMCON: PWMMOD Position */
#define EPWM_PWMCON_PWMMOD_Msk                   (0x3ul << EPWM_PWMCON_PWMMOD_Pos)      /*!< EPWM_T::PWMCON: PWMMOD Mask */

/* EPWM PWMSTS Bit Field Definitions */
#define EPWM_PWMSTS_BK1STS_Pos                   25                                     /*!< EPWM_T::PWMSTS: BK1STS Position */
#define EPWM_PWMSTS_BK1STS_Msk                   (0x1ul << EPWM_PWMSTS_BK1STS_Pos)      /*!< EPWM_T::PWMSTS: BK1STS Mask */

#define EPWM_PWMSTS_BK0STS_Pos                   24                                     /*!< EPWM_T::PWMSTS: BK0STS Position */
#define EPWM_PWMSTS_BK0STS_Msk                   (0x1ul << EPWM_PWMSTS_BK0STS_Pos)      /*!< EPWM_T::PWMSTS: BK0STS Mask */

#define EPWM_PWMSTS_BKLK0_Pos                    8                                      /*!< EPWM_T::PWMSTS: BKLK0 Position */
#define EPWM_PWMSTS_BKLK0_Msk                    (0x1ul << EPWM_PWMSTS_BKLK0_Pos)       /*!< EPWM_T::PWMSTS: BKLK0 Mask */

