MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
#define EPWM_PWMSTS_PWM4EF_Pos                   6                                      /*!< EPWM_T::PWMSTS: PWM4EF Position */
#define EPWM_PWMSTS_PWM4EF_Msk                   (0x1ul << EPWM_PWMSTS_PWM4EF_Pos)      /*!< EPWM_T::PWMSTS: PWM4EF Mask */

#define EPWM_PWMSTS_PWM2EF_Pos                   5                                      /*!< EPWM_T::PWMSTS: PWM2EF Position */
#define EPWM_PWMSTS_PWM2EF_Msk                   (0x1ul << EPWM_PWMSTS_PWM2EF_Pos)      /*!< EPWM_T::PWMSTS: PWM2EF Mask */

#define EPWM_PWMSTS_PWM0EF_Pos                   4                                      /*!< EPWM_T::PWMSTS: PWM0EF Position */
#define EPWM_PWMSTS_PWM0EF_Msk                   (0x1ul << EPWM_PWMSTS_PWM0EF_Pos)      /*!< EPWM_T::PWMSTS: PWM0EF Mask */

#define EPWM_PWMSTS_PWMF_Pos                     2                                      /*!< EPWM_T::PWMSTS: PWMF Position */
#define EPWM_PWMSTS_PWMF_Msk                     (0x1ul << EPWM_PWMSTS_PWMF_Pos)        /*!< EPWM_T::PWMSTS: PWMF Mask */

#define EPWM_PWMSTS_BKF1_Pos                     1                                      /*!< EPWM_T::PWMSTS: BKF1 Position */
#define EPWM_PWMSTS_BKF1_Msk                     (0x1ul << EPWM_PWMSTS_BKF1_Pos)        /*!< EPWM_T::PWMSTS: BKF1 Mask */

#define EPWM_PWMSTS_BKF0_Pos                     0                                      /*!< EPWM_T::PWMSTS: BKF0 Position */
#define EPWM_PWMSTS_BKF0_Msk                     (0x1ul << EPWM_PWMSTS_BKF0_Pos)        /*!< EPWM_T::PWMSTS: BKF0 Mask */

/* EPWM PWMP Bit Field Definitions */
#define EPWM_PWMP_PWMP_Pos                       0                                      /*!< EPWM_T::PWMP: PWMP Position */
#define EPWM_PWMP_PWMP_Msk                       (0xFFFFul << EPWM_PWMP_PWMP_Pos)       /*!< EPWM_T::PWMP: PWMP Mask */

/* EPWM PWM0 Bit Field Definitions */
#define EPWM_PWM0_PWM_Duty_Pos                   0                                      /*!< EPWM_T::PWM0: PWM_Duty Position */
#define EPWM_PWM0_PWM_Duty_Msk                   (0xFFFFul << EPWM_PWM0_PWM_Duty_Pos)   /*!< EPWM_T::PWM0: PWM_Duty Mask */

/* EPWM PWM2 Bit Field Definitions */
#define EPWM_PWM2_PWM_Duty_Pos                   0                                      /*!< EPWM_T::PWM2: PWM_Duty Position */
#define EPWM_PWM2_PWM_Duty_Msk                   (0xFFFFul << EPWM_PWM2_PWM_Duty_Pos)   /*!< EPWM_T::PWM2: PWM_Duty Mask */

/* EPWM PWM4 Bit Field Definitions */
#define EPWM_PWM4_PWM_Duty_Pos                   0                                      /*!< EPWM_T::PWM4: PWM_Duty Position */
#define EPWM_PWM4_PWM_Duty_Msk                   (0xFFFFul << EPWM_PWM4_PWM_Duty_Pos)   /*!< EPWM_T::PWM4: PWM_Duty Mask */

/* EPWM PMSKE Bit Field Definitions */
#define EPWM_PMSKE_PMSKE_Pos                     0                                      /*!< EPWM_T::PMSKE: PMSKE Position */
#define EPWM_PMSKE_PMSKE_Msk                     (0x3Ful << EPWM_PMSKE_PMSKE_Pos)       /*!< EPWM_T::PMSKE: PMSKE Mask */

/* EPWM PMSKD Bit Field Definitions */
#define EPWM_PMSKD_PMSKD_Pos                     0                                      /*!< EPWM_T::PMSKD: PMSKD Position */
#define EPWM_PMSKD_PMSKD_Msk                     (0x3Ful << EPWM_PMSKD_PMSKD_Pos)       /*!< EPWM_T::PMSKD: PMSKD Mask */

/* EPWM PDTC Bit Field Definitions */
#define EPWM_PDTC_DTEN4_Pos                      18                                     /*!< EPWM_T::PDTC: DTEN4 Position */
#define EPWM_PDTC_DTEN4_Msk                      (0x1ul << EPWM_PDTC_DTEN4_Pos)         /*!< EPWM_T::PDTC: DTEN4 Mask */

#define EPWM_PDTC_DTEN2_Pos                      17                                     /*!< EPWM_T::PDTC: DTEN2 Position */
#define EPWM_PDTC_DTEN2_Msk                      (0x1ul << EPWM_PDTC_DTEN2_Pos)         /*!< EPWM_T::PDTC: DTEN2 Mask */

#define EPWM_PDTC_DTEN0_Pos                      16                                     /*!< EPWM_T::PDTC: DTEN0 Position */
#define EPWM_PDTC_DTEN0_Msk                      (0x1ul << EPWM_PDTC_DTEN0_Pos)         /*!< EPWM_T::PDTC: DTEN0 Mask */

#define EPWM_PDTC_DTCNT_Pos                      0                                      /*!< EPWM_T::PDTC: DTCNT Position */
#define EPWM_PDTC_DTCNT_Msk                      (0x7FFul << EPWM_PDTC_DTCNT_Pos)       /*!< EPWM_T::PDTC: DTCNT Mask */

/* EPWM PWMB Bit Field Definitions */
#define EPWM_PWMB_PWMB_Pos                       0                                      /*!< EPWM_T::PWMB: PWMB Position */
#define EPWM_PWMB_PWMB_Msk                       (0x3Ful << EPWM_PWMB_PWMB_Pos)         /*!< EPWM_T::PWMB: PWMB Mask */

/* EPWM PNPC Bit Field Definitions */
#define EPWM_PNPC_PNP5_Pos                       5                                      /*!< EPWM_T::PNPC: PNP5 Position */
#define EPWM_PNPC_PNP5_Msk                       (0x1ul << EPWM_PNPC_PNP5_Pos)          /*!< EPWM_T::PNPC: PNP5 Mask */

#define EPWM_PNPC_PNP4_Pos                       4                                      /*!< EPWM_T::PNPC: PNP4 Position */
#define EPWM_PNPC_PNP4_Msk                       (0x1ul << EPWM_PNPC_PNP4_Pos)          /*!< EPWM_T::PNPC: PNP4 Mask */

#define EPWM_PNPC_PNP3_Pos                       3                                      /*!< EPWM_T::PNPC: PNP3 Position */
#define EPWM_PNPC_PNP3_Msk                       (0x1ul << EPWM_PNPC_PNP3_Pos)          /*!< EPWM_T::PNPC: PNP3 Mask */

#define EPWM_PNPC_PNP2_Pos                       2                                      /*!< EPWM_T::PNPC: PNP2 Position */
#define EPWM_PNPC_PNP2_Msk                       (0x1ul << EPWM_PNPC_PNP2_Pos)          /*!< EPWM_T::PNPC: PNP2 Mask */

#define EPWM_PNPC_PNP1_Pos                       1                                      /*!< EPWM_T::PNPC: PNP1 Position */
#define EPWM_PNPC_PNP1_Msk                       (0x1ul << EPWM_PNPC_PNP1_Pos)          /*!< EPWM_T::PNPC: PNP1 Mask */

#define EPWM_PNPC_PNP0_Pos                       1                                      /*!< EPWM_T::PNPC: PNP0 Position */
#define EPWM_PNPC_PNP0_Msk                       (0x1ul << EPWM_PNPC_PNP0_Pos)          /*!< EPWM_T::PNPC: PNP0 Mask */

/* EPWM PWMFCNT Bit Field Definitions */
#define EPWM_PWMFCNT_PWMFCNT_Pos                 0                                      /*!< EPWM_T::PWMFCNT: PWMFCNT Position */
#define EPWM_PWMFCNT_PWMFCNT_Msk                 (0xFul << EPWM_PWMFCNT_PWMFCNT_Pos)    /*!< EPWM_T::PWMFCNT: PWMFCNT Mask */

