MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/M0519VE3AE/mcu.h
#define SYS_P9_MFP_P9_MFP_Pos                   0                                       /*!< GCR_T::P9_MFP: P9_MFP Position */
#define SYS_P9_MFP_P9_MFP_Msk                   (0xFFul << SYS_P9_MFP_P9_MFP_Pos)       /*!< GCR_T::P9_MFP: P9_MFP Mask */

/* GCR PA_MFP Bit Field Definitions */
#define SYS_PA_MFP_PA_TYPE_Pos                  16                                      /*!< GCR_T::PA_MFP: PA_TYPE Position */
#define SYS_PA_MFP_PA_TYPE_Msk                  (0xFFul << SYS_PA_MFP_PA_TYPE_Pos)      /*!< GCR_T::PA_MFP: PA_TYPE Mask */

#define SYS_PA_MFP_PA_ALT_Pos                   8                                       /*!< GCR_T::PA_MFP: PA_ALT Position */
#define SYS_PA_MFP_PA_ALT_Msk                   (0xFFul << SYS_PA_MFP_PA_ALT_Pos)       /*!< GCR_T::PA_MFP: PA_ALT Mask */

#define SYS_PA_MFP_PA_MFP_Pos                   0                                       /*!< GCR_T::PA_MFP: PA_MFP Position */
#define SYS_PA_MFP_PA_MFP_Msk                   (0xFFul << SYS_PA_MFP_PA_MFP_Pos)       /*!< GCR_T::PA_MFP: PA_MFP Mask */

/* GCR REGWRPROT Bit Field Definitions */
#define SYS_REGWRPROT_REGWRPROT_Pos             0                                       /*!< GCR_T::REGWRPROT: REGWRPROT Position */
#define SYS_REGWRPROT_REGWRPROT_Msk             (0xFFul << SYS_REGWRPROT_REGWRPROT_Pos) /*!< GCR_T::REGWRPROT: REGWRPROT Mask */

#define SYS_REGWRPROT_REGPROTDIS_Pos            0                                       /*!< GCR_T::REGWRPROT: REGPROTDIS Position */
#define SYS_REGWRPROT_REGPROTDIS_Msk            (1ul << SYS_REGWRPROT_REGPROTDIS_Pos)   /*!< GCR_T::REGWRPROT: REGPROTDIS Mask */


typedef struct
{


    /**
     * @var GCR_INT_T::IRQ_SRC[32]
     * Offset: 0x00-0x7C  IRQn(n=0~31) Interrupt Source Identity Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[5:0]   |INT_SRC   |Interrupt Source Identity
     * |        |          |IRQ_SRC[0].0 - BOD INT
     * |        |          |IRQ_SRC[1].0 - WDT INT
     * |        |          |IRQ_SRC[1].1 - WWDT INT
     * |        |          |IRQ_SRC[2].0 - EINT0, external interrupt 0 from P3.2
     * |        |          |IRQ_SRC[3].0 - EINT1, external interrupt 1 from P3.3
     * |        |          |IRQ_SRC[4].0 - P0 INT
     * |        |          |IRQ_SRC[4].1 - P1 INT
     * |        |          |IRQ_SRC[4].2 - P2 INT
     * |        |          |IRQ_SRC[4].3 - P3_INT
     * |        |          |IRQ_SRC[4].4 - P4_INT
     * |        |          |IRQ_SRC[5].0 - P5 INT
     * |        |          |IRQ_SRC[5].1 - P6 INT
     * |        |          |IRQ_SRC[5].2 - P7 INT
     * |        |          |IRQ_SRC[5].3 - P8 INT
     * |        |          |IRQ_SRC[5].4 - P9 INT
     * |        |          |IRQ_SRC[5].5 - PA INT
     * |        |          |IRQ_SRC[6].0 - BPWM0 CH0 INT
     * |        |          |IRQ_SRC[6].1 - BPWM0 CH1 INT
     * |        |          |IRQ_SRC[7].0 - EADC0 INT
     * |        |          |IRQ_SRC[8].0 - TIMER0 INT
     * |        |          |IRQ_SRC[9].0 - TIMER1 INT
     * |        |          |IRQ_SRC[10].0 - TIMER2 INT
     * |        |          |IRQ_SRC[11].0 - TIMER3 INT
     * |        |          |IRQ_SRC[12].0 - UART0 INT
     * |        |          |IRQ_SRC[13].0 - UART1 INT
     * |        |          |IRQ_SRC[14].0 - SPI0 INT
     * |        |          |IRQ_SRC[15].0 - SPI1 INT
     * |        |          |IRQ_SRC[16].0 - SPI2 INT
     * |        |          |IRQ_SRC[18].0 - I2C0 INT
     * |        |          |IRQ_SRC[21].0 - EPWM0 INT
     * |        |          |IRQ_SRC[22].0 - EPWM1 INT
     * |        |          |IRQ_SRC[23].0 - ECAP0 INT
     * |        |          |IRQ_SRC[24].0 - ECAP1 INT
     * |        |          |IRQ_SRC[25].0 - ACMP INT
     * |        |          |IRQ_SRC[28].0 - Power Down Wake up INT
     * |        |          |IRQ_SRC[29].0 - EADC1 INT
     * |        |          |IRQ_SRC[30].0 - EADC2 INT
     * |        |          |IRQ_SRC[31].0 - EADC3 INT
     * @var GCR_INT_T::NMI_SEL
     * Offset: 0x80  NMI Interrupt Source Select Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[4:0]   |NMI_SEL   |NMI interrupt source selection
     * |        |          |The NMI interrupt to Cortex-M0 can be selected from one of IRQ0~IRQ31 by setting NMI_SEL with IRQ number.
     * |        |          |The default NMI interrupt is assigned as IRQ0 interrupt if NMI is enabled by setting NMI_SEL[8].
     * |[8]     |NMI_EN    |NMI interrupt enable (Write Protect)
     * |        |          |0 = IRQ0~31 assigned to NMI interrupt Disabled. (NMI still can be software triggered by setting its pending flag.)
     * |        |          |1 = IRQ0~31 assigned to NMI interrupt Enabled.
     * |        |          |Note: This bit is write protected bit. Refer to the REGWRPROT register.
     * @var GCR_INT_T::MCU_IRQ
     * Offset: 0x84  MCU Interrupt Request Source Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |MCU_IRQ   |MCU IRQ Source Register
     * |        |          |The MCU_IRQ collects all the interrupts from the peripherals and generates the synchronous interrupt to Cortex-M0.
     * |        |          |When the MCU_IRQ[n] is 0, setting:
     * |        |          |0 = No effect.
     * |        |          |1 = Generate an interrupt to Cortex_M0 NVIC[n].
     * |        |          |When the MCU_IRQ[n] is 1 (means an interrupt is assert), setting:
     * |        |          |0 = No effect.
     * |        |          |1 = Clear the interrupt and MCU_IRQ[n].
     * @var GCR_INT_T::MCU_IRQCR
     * Offset: 0x88  MCU Interrupt Request Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[31:0]  |FAST_IRQ  |Fast IRQ Latency Enable Control
     * |        |          |0 = MCU IRQ latency is fixed at 13 clock cycles of HCLK, MCU will enter IRQ handler after this fixed latency when interrupt happened.
     * |        |          |1 = MCU IRQ latency will not fixed, MCU will enter IRQ handler as soon as possible when interrupt happened.
     */

    __I  uint32_t IRQSRC[32];   /* Offset: 0x00-0x7C  IRQn(n=0~31) Interrupt Source Identity Register               */
    __IO uint32_t NMISEL;       /* Offset: 0x80  NMI Interrupt Source Select Control Register                       */
    __IO uint32_t MCUIRQ;       /* Offset: 0x84  MCU Interrupt Request Source Register                              */
    __IO uint32_t MCUIRQCR;     /* Offset: 0x88  MCU Interrupt Request Control Register                             */

